{
    "Air and Space": {
        "ID": "HNRS310",
        "UNITS": "4",
        "DESC": "Technological developments of modern aircraft and spacecraft through physics of flight equations, mission analysis, propulsion, structures, materials, and control systems for civil and military aircraft/spacecraft.  Synthesis of current and future aerospace technologies through emerging ethical considerations, and global impact.  4 lectures.  Course may be offered in classroom-based or online format.  Crosslisted as AERO/HNRSÂ 310.  Fulfills GE Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Principles of Organic Crop Production": {
        "ID": "PLSC315",
        "UNITS": "4",
        "DESC": "Origins, application, regulation and technology of organic crop production.  Theoretical and practical issues surrounding organic crop production from a cross-disciplinary perspective.  Topics include the history of the organic movement; current regulation and certification; and field management practices and technologies.  Features industry guest lecturers.  Field trip required.  3 lectures, 1 activity.  Crosslisted as AG/PLSCÂ 315.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).  Formerly AEPS/AGÂ 315.\n"
    },
    "Cal Poly Land: Nature, Technology, and Society": {
        "ID": "UNIV330",
        "UNITS": "4",
        "DESC": "Scientific investigation of the natural features of the Cal Poly landscape and their transformations by land management technology.  Environmental, economic, social, and political effects of agriculture, resource extraction, construction technology.  Educational, land-use, long term planning issues.  4 lectures.  Crosslisted as AG/ISLA/SCM/UNIVÂ 330.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "The Global Environment": {
        "ID": "UNIV350",
        "UNITS": "4",
        "DESC": "Interdisciplinary investigation of how human activities impact the Earth's environment on a global scale.  Examination of population, resource use, climate change, and biodiversity from scientific/technical and social/economic/ historical/political perspectives.  Use of remote sensing maps.  Sustainable solutions.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as AG/EDES/ENGR/GEOG/ISLA/SCM/UNIVÂ 350.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Holistic Management": {
        "ID": "ASCI360",
        "UNITS": "4",
        "DESC": "Application of holistic management, a goal-oriented, value-driven framework for making ecologically, economically, and socially sound decisions.  Holistic approach to management, especially of land-based resources, aimed toward greater biodiversity and sustainability.  3 lectures, 1 laboratory.  Crosslisted as AG/ASCIÂ 360.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Principles of Animal Science": {
        "ID": "ASCI112",
        "UNITS": "4",
        "DESC": "Comparative physiology of digestive, endocrine, and reproductive systems in animals. Principles of nutrition, genetics, growth, behavior, food processing and safety of animals. Current issues including biosecurity, animal welfare, and government safeguards for human and animal health. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area B2.\n"
    },
    "Safe Handling of Animal-Based Foods for Consumers": {
        "ID": "ASCI215",
        "UNITS": "4",
        "DESC": "Safe food handling of meat, dairy and egg products, emphasizing consumer knowledge in food safety from farm to table. Ecology of microorganisms in the kitchen environment. Detection, enumeration, and identification of pathogens and indicator microorganisms in animal-based food products. 3 Lectures, 1 laboratory. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Physiological Chemistry of Animals": {
        "ID": "ASCI319",
        "UNITS": "4",
        "DESC": "Integration of the principles of chemistry, biochemistry, physiology and nutrition to understand metabolism of carbohydrates, lipids and proteins at the cellular, organ and whole animal level.  Regulation and coordination of metabolic function within and across tissues in domesticated and wild animals.  Course may be offered in classroom-based or online format.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Cultural Anthropology": {
        "ID": "ANT201",
        "UNITS": "4",
        "DESC": "Cultural patterns, divergence and uniformity in language and communication, family organization, gender, and adaptation to environment. Economics and productivity, political organization, religion and ritual, ethnicity and race, illness and healing, globalization and culture change. Skills: ethnographic analysis and cultural relativity. Course may be offered in classroom-based, online or hybrid format. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "World History Before Writing": {
        "ID": "ANT202",
        "UNITS": "4",
        "DESC": "Long-term development of global biological and cultural diversity from emergence of the first human ancestors 6-7 million years ago to the advent of writing. Biological evolution, cultural development, emergent socio-political complexity and social inequality, migrations, adaptation to climate change, and sustainability. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Biological Anthropology": {
        "ID": "ANT250",
        "UNITS": "4",
        "DESC": "Biological aspects of human unity and diversity. Primate and human evolution, including anatomical, physiological and behavioral adaptations. Evolutionary ecological perspectives and theories on human behavior and biology. Field trip required. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Fulfills GE Area B2.\n"
    },
    "Indigenous South Americans": {
        "ID": "ANT330",
        "UNITS": "4",
        "DESC": "Indigenous peoples of South America from the past to the present.  Cross-cultural study of small band societies, tribes and large civilization states located from the Amazon basin to the Altiplano.  Comparison of current state of indigenous rights and place in modern society.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Sex, Death, and Human Nature": {
        "ID": "ANT344",
        "UNITS": "4",
        "DESC": "How Darwinian processes of differential reproduction and mortality influence human interests, passions and behaviors.  Theories of inclusive fitness, parental investment and senescence.  Sex differences, sexual attraction, life histories, violence and aggression, including rape, homicide and infanticide.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Human Behavioral Ecology": {
        "ID": "ANT345",
        "UNITS": "4",
        "DESC": "Biological and cultural influences of natural and sexual selection on individual behavior.  Ecological effects on human behavior to reproduce and acquire resources.  Scientific method for understanding foraging behavior, group living, social skills, kinship, parenting, religion, and mating.  Cross-cultural, cross-sex, and cross-species comparisons.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Human Cultural Adaptations": {
        "ID": "ANT360",
        "UNITS": "4",
        "DESC": "Social and cultural evolution from Paleolithic times to the present.  Interactions of demographic, economic and ecological factors are emphasized.  Main topics include human nature/culture, sex and gender, cooperation and conflict, the 'agricultural revolution', state formation, social inequality and globalization.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Anthropology-Geography Research Design and Methods": {
        "ID": "GEOG455",
        "UNITS": "4",
        "DESC": "Development of knowledge and skills needed to conduct original scientific anthropology-geography research and prepares students for senior projects.  Various empirical methodologies highlighted, with a focus on quantitative design and measurement of human culture, biology, behavior, environment and ecology.  Course may be offered in classroom-based, online, or hybrid.  3 lectures, 1 laboratory.  Crosslisted as ANT/GEOGÂ 455.\n"
    },
    "History of Structures": {
        "ID": "ARCE260",
        "UNITS": "4",
        "DESC": "Social, symbolic, and technical importance of landmark structures. Analysis of breakthrough ideas that led to major advances in building design. Contextualization of these advances. Tools by which to assess and critique structural art as a separate and distinct art form. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Equilibrium Without Statics": {
        "ID": "ARCE360",
        "UNITS": "4",
        "DESC": "Equilibrium without statics via state of the art geometric visualization and programming.  Use of a programmed drawing environment to study the flow of loads through a building.  Mathematical insights into Virtual Work and both Castigliano's Theorems.  Historical analysis and context.  Course is offered online only.  4 Lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Architecture Design Studio for Non-Majors": {
        "ID": "ARCH201",
        "UNITS": "4",
        "DESC": "Introduction to processes, tools, and methods of drawing and modeling for architectural design. Analysis of architectural case studies to provide an overview of architectural concepts and constructs. Studio experience includes architectural design projects at varying scales. Not open for major credit in Architecture. Course may be offered in classroom-based or online format. 3 lectures, 1 laboratory. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of World Architecture: Prehistory - Middle Ages": {
        "ID": "ARCH217",
        "UNITS": "4",
        "DESC": "Architecture and urbanism in the ancient world, from prehistory to the Middle Ages. Social, cultural and physical conditions that influenced the built environment to the Mediterranean basis, plus Europe, Asia, Africa and Pre-Columbian America. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of World Architecture: Middle Ages - 18th Century": {
        "ID": "ARCH218",
        "UNITS": "4",
        "DESC": "World architecture and urbanism from the Middle Ages until the end of the 18th century Baroque. Social, cultural and physical conditions which influenced the built environment of Europe, Asia, and the Pre-Columbian and Colonial Americas. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of World Architecture: 18th Century - Present": {
        "ID": "ARCH219",
        "UNITS": "4",
        "DESC": "Architecture and urbanism of the modern world, from the 18th century to the present. Social, cultural and physical conditions influencing the built environment of Europe, Asia, Africa and the Americas. Course may be offered classroom-based or online format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Topics in Architectural History": {
        "ID": "ARCH320",
        "UNITS": "4",
        "DESC": "In-depth examination of a significant region, movement or period in architectural history, theory and criticism.  The material covered will vary depending upon the topic.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Native American Architecture and Place": {
        "ID": "ES326",
        "UNITS": "4",
        "DESC": "The role of culture and setting in the construction of spatial, material and landscape concepts and artifacts, through the introduction of selected North American cultures, with focus from 1300 AD through contemporary time.  4 lectures.  Crosslisted as ARCH/ESÂ 326.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Fundamentals of Drawing": {
        "ID": "ART101",
        "UNITS": "4",
        "DESC": "Introduction to the artistic practice and cultural value of drawing with emphasis on the practical skills of observation, rendering, and understanding meaning in visual art. Projects encourage growth in technical skill, conceptual innovation, critical thinking, and visual communication. 3 lectures, 1 laboratory. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to the Visual Arts": {
        "ID": "ART111",
        "UNITS": "4",
        "DESC": "Introduction to the material techniques and social purposes of painting, graphic arts, sculpture, performance, and architecture across diverse cultures. Builds visual analysis skills and research techniques needed to interpret and talk about the visual arts broadly. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Western Art: A Thematic History": {
        "ID": "ART112",
        "UNITS": "4",
        "DESC": "Introduction to artistic production, reception, and meaning throughout different eras and contexts of Western civilization. Evaluates the role of art in relation to religion, politics, and commemoration while considering the expressive nature and affective qualities of images and objects. Field trip required. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2021-22 or earlier catalogs).\n"
    },
    "Introduction to Digital Photography": {
        "ID": "ART122",
        "UNITS": "4",
        "DESC": "Fundamental techniques in photography. Mechanics of digital cameras, optics, composition, perception of light and subject content. Understanding photographic principles and the language of camera vision. Introduction to the impact of photography on culture. Digital camera required. 3 lectures, 1 laboratory. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Ceramics I": {
        "ID": "ART145",
        "UNITS": "4",
        "DESC": "Introduction to artistic practice and cultural value from antiquity to 21st Century. Basic clay working emphasizing design quality, hand building, and potter's wheel. Exercises encouraging growth in technical skill, use of materials for personal expression, conceptual innovation, critical thinking, and visual communication. 3 lectures, 1 laboratory. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Beginning Sculpture": {
        "ID": "ART148",
        "UNITS": "4",
        "DESC": "Introduction to the challenges, methods, and modalities within the expanding field of contemporary sculpture. Emphasis on understanding the signs of meaning produced in visual art. Exploration of materials, tools, and techniques including found objects, casting, carving, wood, and metal. 3 lectures, 1 laboratory. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Art History - Nineteenth Century Art": {
        "ID": "ART311",
        "UNITS": "4",
        "DESC": "History of painting and sculpture from the French Revolution to the beginning of the 20th century.  Focuses on significant movements such as Neo-Classicism, Romanticism, Realism, Impressionism and Post-Impressionism.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of Photography": {
        "ID": "ART314",
        "UNITS": "4",
        "DESC": "In-depth survey of the artistic and cultural achievements in photography from its invention to the present day.  Significant photographers, the evolution of aesthetic criteria in the context of other visual arts as well as social/cultural impact.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Asian Art Topics: National, Religious, and Intellectual Movements": {
        "ID": "ART318",
        "UNITS": "4",
        "DESC": "In-depth examination of significant art movements in Asia.  Each topic will focus on the development of art in Asia within the context of a specific geographical or theoretical framework.  Details will vary depending on topic.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Michelangelo": {
        "ID": "ART370",
        "UNITS": "4",
        "DESC": "The art and life of Michelangelo (1475-1564), the renowned painter, sculptor, architect, and poet, with reference to early biographies, his artistic development, and the demands of his patrons.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Topics in Renaissance Art": {
        "ID": "ART371",
        "UNITS": "4",
        "DESC": "A thematic analysis of Renaissance Art (1300-1600) with special attention paid to politics, patronage, myth, religion, and the development of new genres and subject matter.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to the Solar System": {
        "ID": "ASTR101",
        "UNITS": "4",
        "DESC": "Descriptive astronomical properties of the Earth, Moon, other planets and their satellites. Comets, asteroids and other members of the Solar System. Theories of the formation of the Solar System. Opportunities for astronomical observations. Intended for non-engineering and non-science majors. Not open to students who have completed or are taking ASTRÂ 301 or ASTRÂ 302. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Stars and Galaxies": {
        "ID": "ASTR102",
        "UNITS": "4",
        "DESC": "Descriptive astronomical properties of the Sun, stars, galaxies and interstellar material. Expanding universe and cosmological models. Opportunities for astronomical observations. Not open to students who have completed or are taking ASTRÂ 301, ASTRÂ 302, PHYS 132 or PHYSÂ 142. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Longitude, Navigation, and Timekeeping": {
        "ID": "ASTR324",
        "UNITS": "4",
        "DESC": "Evolution of navigational science from 1700 to today, covering the 'longitude problem' to the Global Positioning System.  Emphasizes relevant concerns with navigation and timekeeping, including celestial navigation, clocks, and the use of technology, mathematics, and science to address societal problems.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "General Biology": {
        "ID": "BIO111",
        "UNITS": "4",
        "DESC": "Overview of fundamental concepts in biology and of scientific inquiry. Principles of cellular life and energetics, inheritance and genetic mechanisms, evolution and ecology. Emphasis on the relationship between biology and human affairs. Not open for major credit in Biological Sciences, Microbiology or Marine Sciences. Not open to students who have completed BIOÂ 161. Course offered in hybrid format with classroom-based and online learning. 3 lectures, 1 laboratory. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Plant Diversity and Ecology": {
        "ID": "BIO114",
        "UNITS": "4",
        "DESC": "Plant diversity and ecology in aquatic and terrestrial plant communities including adaptations of plants to their environment. Identification of common, local native plants and plant communities, uses of native plants by Indigenous People, and human impacts on native plant communities. Field trip required. 2 lectures, 2 laboratories. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Biology of Sex": {
        "ID": "BIO123",
        "UNITS": "4",
        "DESC": "Fundamental principles of biology related to sexual reproduction: genetics, physiology, behavior, ecology and evolution of sex in a broad range of organisms. Not open for major credit in Biological Sciences, Microbiology, or Marine Sciences. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area B2.\n"
    },
    "Diversity and History of Life": {
        "ID": "BIO150",
        "UNITS": "4",
        "DESC": "Overview of the history, diversity and genetic relatedness of life on Earth. Broad-scale evolutionary framework of the organization and expansion of life on Earth. 3 lectures, 1 laboratory. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Cell and Molecular Biology": {
        "ID": "BIO161",
        "UNITS": "4",
        "DESC": "Fundamentals of cellular biology with an emphasis on the molecular perspective of life:  biomolecules, cellular energetics, cell structure and reproduction, molecular mechanisms of genetics and gene expression.  3 lectures, 1 laboratory.  Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Life Science for Engineers": {
        "ID": "BIO213",
        "UNITS": "2",
        "DESC": "Fundamentals of life sciences:  energetics, cell biology, genetics, microbiology, organismal biology, and ecology.  Not open for major credit in Biological Sciences, Microbiology, or Marine Sciences.  2 lectures.  Fulfills GE B2.\n"
    },
    "Biodiversity of California": {
        "ID": "BIO222",
        "UNITS": "4",
        "DESC": "Foundations and importance of California's biological diversity from historical and modern contexts.  Overview of California's diverse habitats, wildlife and their adaptations.  Current challenges to preserving California's biodiversity.  Concepts in quantification, conservation and appreciation for California's biodiversity.  4 lectures.  Fulfills GE Area B2.\n"
    },
    "Wildlife Conservation Biology": {
        "ID": "BIO227",
        "UNITS": "4",
        "DESC": "Wildlife biology and philosophies of conservation.  Basic principles of ecology and evolution.  Practices applied to wildlife management.  Current problems involving people-wildlife interactions with special reference to world biodiversity.  Not open for major credit in Biological Sciences, Microbiology, or Marine Sciences.  Not open to students with credit in BIOÂ 363.  4 lectures.  Fulfills GE Area B2.\n"
    },
    "Human Genetics": {
        "ID": "BIO302",
        "UNITS": "4",
        "DESC": "Basic principles of human inheritance, including the transmission of genetic traits, chromosomal abnormalities and their effects, gene structure and function, mutations and mutagenic agents, cancer genetics, population genetics, and principles of genetic counseling.  Not open for major credit in Biological Sciences, Microbiology, or Marine Sciences.  Not open to students with credit in BIOÂ 303 or BIOÂ 351.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Biology of Cancer": {
        "ID": "BIO305",
        "UNITS": "4",
        "DESC": "Introduction to the causes, characteristics and treatment of human cancer.  Effects of carcinogens and radiation; the genetics of cancer; molecular, cellular and physiological changes in common cancers; conventional chemotherapy and new treatments.  Not open for major credit in Biological Sciences, Microbiology, Marine Sciences, or Biochemistry.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Genetic Engineering Technology": {
        "ID": "CHEM308",
        "UNITS": "4",
        "DESC": "Introduction to the biology, methodology, and techniques used in genetic engineering.  Potential benefits and problems in application within agriculture, nutrition, medicine and environmental context, including the underlying ethical questions.  Not open to students with credit in CHEMÂ 373, or to Biological Sciences, Marine Sciences, or Microbiology majors.  4 lectures.  Crosslisted as BIO/CHEMÂ 308.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Bioengineering Fundamentals": {
        "ID": "BRAE213",
        "UNITS": "2",
        "DESC": "Treatment of the engineering applications of biology.  Genetic engineering and the industrial application of microbiology.  Systems physiology with engineering applications.  Structure and function relationships in biological systems.  The impact of life on its environment.  Course may be offered in classroom-based or online format.  2 lectures.  Crosslisted as BMED/BRAEÂ 213.  Fulfills GE B2.\n"
    },
    "Introduction to Biological Systems": {
        "ID": "BRAE220",
        "UNITS": "4",
        "DESC": "Systems approach to introductory life science that focuses on patterns and cycles in biology.  Introductory modeling and quantitative measurement of life science parameters.  Emphasis on the interaction between organisms and their environment.  Course may be offered in classroom-based or hybrid format.  3 lectures, 1 laboratory.  Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Irrigation Water Management": {
        "ID": "BRAE340",
        "UNITS": "4",
        "DESC": "California water supply and budget; water rights and issues.  Local, state and federal water institutions.  Water measurement; basic hydraulics; irrigation systems; distribution uniformity and efficiency.  Soil-plant-water relationships; soil moisture measurement; evapotranspiration; irrigation schedules; practical constraints affecting scheduling; salinity and drainage.  Course may be offered in classroom-based, online, or hybrid format.  3 lectures, 1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Energy for a Sustainable Society": {
        "ID": "BRAE348",
        "UNITS": "4",
        "DESC": "Study of how the transition can be made from fossil fuels to renewable energy sources including hydro, biomass, solar, wind, and energy conservation.  Environmental, economic, and political consequences of a renewable energy-based sustainable society.  3 lectures, 1 activity.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Water for a Sustainable Society": {
        "ID": "NR349",
        "UNITS": "4",
        "DESC": "Historical, political, economic, socio-technical, and cultural dimensions of water sustainability.  Overview of complex systems with an emphasis on individual choices and their impact on water sustainability.  Exploration of core sustainability concepts; practices, barriers and goals related to water resources.  Course offered online only.  4 lectures.  Crosslisted BRAE/NRÂ 349.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Botany": {
        "ID": "BOT121",
        "UNITS": "4",
        "DESC": "The anatomy, morphology, physiology, reproduction, diversity, and importance of plants. 3 lectures, 1 laboratory. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Plants, People and Civilization": {
        "ID": "BOT311",
        "UNITS": "4",
        "DESC": "Human uses of plants for food, beverage, medicine, fiber, recreation, and rituals.  Uses of plants by different cultures throughout the world and the social, economical, and environmental importance of plants in our lives.  Field trip required.  3 lectures, 1 laboratory.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Financial Literacy": {
        "ID": "BUS204",
        "UNITS": "4",
        "DESC": "Introduction to personal finance. Budgeting, savings, employee benefits, retirement planning, taxes, insurance, and real estate. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area B4.\n"
    },
    "International and Cross Cultural Management": {
        "ID": "BUS302",
        "UNITS": "4",
        "DESC": "Dimensions of culture and its variations within and across nations.  Impact of culture on managing in a global context.  Development of managerial competencies requisite to working in and supervising multicultural groups in international corporations.  Frameworks for analyzing cultural and contextual influences on organizational behavior, culture shock and readjustment, expatriation and repatriation, cultural change and innovation, intercultural conflict, and ethical dilemmas.  Case studies, behavioral simulations, self-assessments and fieldwork.  4 lectures.\n"
    },
    "Managing Technology in the International Legal Environment": {
        "ID": "BUS311",
        "UNITS": "4",
        "DESC": "Analysis of U.S.  and international laws regarding technological innovations from economic, social and political perspectives.  Copyrights, patents, trademarks, trade secrets, contracts, products liability and privacy.  The Internet, computer programs and biotechnology.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Leadership and Organizations": {
        "ID": "BUS382",
        "UNITS": "4",
        "DESC": "Evaluation of macro dimensions of business organizations including environment, mission, goals, strategies, structure, people, and technology.  Internal leadership processes at different organizational levels.  Case analysis, experiential class activities.  Application to business solutions in technology-oriented settings.  4 lectures.\n"
    },
    "Human Resources Management": {
        "ID": "BUS384",
        "UNITS": "4",
        "DESC": "Introduction to functional areas of the discipline including staffing, compensation, employee development and labor relations.  Additional workplace issues addressed include performance and human capital management, employer legal and social responsibility for employee wellbeing, managing a diverse/global workforce, and using human resource information systems.  4 lectures.\n"
    },
    "World of Chemistry": {
        "ID": "CHEM110",
        "UNITS": "4",
        "DESC": "The fundamentals of chemical cause/effect and structure/function relationships.  The basic principles of chemistry and their applications to solving human problems in areas such as toxicology, environmental science, agriculture, nutrition, forensics and medicine.  Not open for major credit in Biochemistry or Chemistry.  Not open to students with credit in CHEM 111, CHEMÂ 124, or CHEMÂ 127.  3 lectures, 1 laboratory.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Chemistry for Physical Science and Engineering I": {
        "ID": "CHEM124",
        "UNITS": "4",
        "DESC": "Introduction to atomic theory, chemical reactions, bonding, stoichiometry, nomenclature, gas laws, thermochemistry, molecular structure, and intermolecular forces.  Intended primarily for students in engineering and/or physical sciences.  Not open to students with credit in CHEMÂ 127.  Credit will be granted in only one of the following courses:  CHEMÂ 110, CHEMÂ 124, or CHEMÂ 127.  3 lectures, 1 laboratory.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Chemistry for Physical Science and Engineering II": {
        "ID": "CHEM125",
        "UNITS": "4",
        "DESC": "Topics include solution chemistry, thermodynamics, kinetics, equilibrium (including acids and bases), electrochemistry, and nuclear chemistry.  Not open to students with credit in CHEMÂ 128.  3 lectures, 1 laboratory.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Chemistry for Agriculture and Life Science I": {
        "ID": "CHEM127",
        "UNITS": "4",
        "DESC": "Introduction to atomic theory, chemical reactions, bonding, stoichiometry, nomenclature, gas laws, thermochemistry, molecular structure, and intermolecular forces.  Intended primarily for students in agriculture and life sciences.  Not open to students with credit in CHEMÂ 124.  Credit will be granted in only one of the following courses:  CHEMÂ 110, CHEMÂ 124, or CHEMÂ 127.  3 lectures, 1 laboratory.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Biochemistry: Fundamentals and Applications": {
        "ID": "CHEM314",
        "UNITS": "5",
        "DESC": "Chemistry of biomolecules including carbohydrates, proteins, lipids, vitamins, enzymes and hormones.  Basic molecular biology with applications to biotechnology and genetic engineering.  Practical intermediary metabolism of prokaryotic and eukaryotic systems.  4 lectures, 1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Chemical and Biological Warfare": {
        "ID": "CHEM349",
        "UNITS": "4",
        "DESC": "History, development, and use of chemical and biological warfare (CBW).  Chemical and biological disarmament.  Production and destruction of CBW agents.  CBW terrorism.  Ethics of CBW.  2 lectures, 2 seminars.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Biochemical Principles": {
        "ID": "CHEM369",
        "UNITS": "5",
        "DESC": "Chemistry and function of major cellular constituents:  proteins, lipids, carbohydrates, nucleic acids, and membranes.  Mechanisms of protein function and regulation and enzyme catalysis.  4 lectures, 1 laboratory.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Elementary Mandarin Chinese I Study Abroad": {
        "ID": "CHIN141",
        "UNITS": "4",
        "DESC": "Beginning Mandarin Chinese.  Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in CHINÂ 101.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Mandarin Chinese II Study Abroad": {
        "ID": "CHIN142",
        "UNITS": "4",
        "DESC": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in CHINÂ 102.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Mandarin Chinese III Study Abroad": {
        "ID": "CHIN143",
        "UNITS": "4",
        "DESC": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in CHINÂ 103.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Mandarin Chinese I Study Abroad": {
        "ID": "CHIN241",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Mandarin Chinese.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in CHINÂ 201.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Mandarin Chinese II Study Abroad": {
        "ID": "CHIN242",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Mandarin Chinese.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in CHINÂ 202.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Mandarin Chinese III Study Abroad": {
        "ID": "CHIN243",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Mandarin Chinese.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in CHINÂ 203.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Digital Cities": {
        "ID": "CRP303",
        "UNITS": "4",
        "DESC": "Explores digital technology changing the way we plan, design, build, govern, and live in cities.  Assess technologies for knowing, digitizing, and engaging citizens in city development, governance, and planning and managing cities.  Opportunities to explore technology initiatives in community building.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Reflections on Biking, Walking and the City": {
        "ID": "CRP325",
        "UNITS": "4",
        "DESC": "Study of the design of cities for walking and bicycling and its importance to the future of transportation and the resilience of cities.  Reflection on how bicycles and pedestrians shape the urban environment through literature, music, policy, and design practices.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Cities in a Global World": {
        "ID": "CRP334",
        "UNITS": "4",
        "DESC": "Examination of the changes in the social and spatial organization of urban settlements in the twenty-first century caused by the urbanization and globalization processes.  Comparative analysis of the traditional and contemporary cities around the globe.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Hazard Mitigation Planning & Resilient Design": {
        "ID": "CRP458",
        "UNITS": "4",
        "DESC": "Creation of safer, more resilient cities through systematic application of urban disaster risk reduction and regeneration planning principles and methods.  Integration of insights from the design, resource management, and urban administration professions for minimizing disaster losses and improving recovery activities.  4 lectures.\n"
    },
    "Public Speaking": {
        "ID": "HNRS101",
        "UNITS": "4",
        "DESC": "Introduction to the principles of oral communication and the tradition of public speaking in political and social life. Practical experience in the development, presentation, and critical analysis of speeches to inform and to persuade. Not open to students with credit in COMSÂ 102. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Crosslisted as COMS/HNRSÂ 101. Fulfills GE Area A1 with a grade of C- or better (GE Area A2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Principles of Oral Communication": {
        "ID": "HNRS102",
        "UNITS": "4",
        "DESC": "Introduction to the fundamentals and principles which underlie effective oral communication. Practical experience in various types of speaking situations: informative speaking, persuasive speaking, and panel discussion. Not open to students with credit in COMSÂ 101. 4 lectures. Crosslisted as COMS/HNRSÂ 102. Fulfills GE Area A1 with a grade of C- or better (GE Area A2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Argument and Advocacy": {
        "ID": "COMS126",
        "UNITS": "4",
        "DESC": "The nature of critical thinking as applied in oral and written argument.  Study of inductive and deductive reasoning.  Analysis of reasoning, argument, forms of support and fallacies of argument and language.  Instruction in and practical experience in crafting sound persuasive arguments and engaging in oral argumentation.  Course may be offered in classroom-based or hybrid format.  4 lectures.   Fulfills GE Area A3 with a grade of C- or better.\n"
    },
    "Reasoning, Argumentation, and Writing": {
        "ID": "COMS145",
        "UNITS": "4",
        "DESC": "The principles of reasoning in argumentation.  Examination of rhetorical principles and responsible rhetorical behavior.  Application of these principles to oral and written communications.  Effective use of research methods and sources.  4 lectures.   Fulfills GE Area A3 with a grade of C- or better.\n"
    },
    "Performance, Literature, and Culture": {
        "ID": "COMS208",
        "UNITS": "4",
        "DESC": "Concepts and skills related to the performance of literature and performance as a theoretical and analytical method.  Emphasis placed on understanding culture and the importance of diversity in human communication.  Students develop and apply critical, analytical, performative, and communicative skills.  4 lectures.  Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Interpersonal Communication": {
        "ID": "COMS211",
        "UNITS": "4",
        "DESC": "Introduction to the interaction process in two-person (dyadic) communication settings.  Emphasis on the functions of varying messages in the initiation, development, maintenance and termination of personal and professional relationships.  4 lectures.  Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs).\n"
    },
    "Group Performance of Literature": {
        "ID": "COMS308",
        "UNITS": "4",
        "DESC": "Examination and experience in the various modes of group performance of literature:  Readers Theatre, Chamber Theatre, Story Theatre.  Scripting; directing; performing and critiquing of group performance of literature.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intercultural Communication": {
        "ID": "COMS316",
        "UNITS": "4",
        "DESC": "Cultural aspects of communication within and among diverse groups.  Particular focus on U.S.  culture and history and the diversity of ethnic, subcultural, and co-cultural groups.  Development of nuanced understanding of the role of culture and communication in human thought, behavior, and interaction.  Not open to students with credit in COMS 416.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Intergroup Communication": {
        "ID": "COMS320",
        "UNITS": "4",
        "DESC": "Theoretical and practical communication issues regarding socially constructed aspects of identity; concentrating on gender, race, sexuality, social class, ability, age, and language through the lens of social constructionism.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Media Effects": {
        "ID": "COMS384",
        "UNITS": "4",
        "DESC": "Effects of media on individuals and society.  Influence of mass media message producers and content on perceptions of social norms, violence, sexuality, gender, race, and ethnicity.  Empirical approaches in media studies and literacy development.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Communication, Media, and Politics": {
        "ID": "COMS386",
        "UNITS": "4",
        "DESC": "Political communication and the U.S.  mass media system, including role of the media in democratic society; news norms, government regulation of media, and media ownership; the changing media landscape and implications for news construction, polarization, and selective exposure; and incivility and bias.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Computing for All I": {
        "ID": "CSC121",
        "UNITS": "4",
        "DESC": "Fundamentals of computational thinking in the study of non-computing disciplines.  Ethical and social considerations of computing.  Data gathering and representation.  Logic and computational reasoning.  Data and procedural abstraction.  Problem decomposition.  Code patterns for algorithmic problem-solving.  3 lectures, 1 activity.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE Area.\n"
    },
    "Computing for All II": {
        "ID": "CSC122",
        "UNITS": "4",
        "DESC": "Fundamentals of computational thinking in the study of non-computing disciplines.  Ethical and social considerations of computing.  Reading code and identifying patterns.  Problem Decomposition.  Algorithms and automation.  Software Engineering.  Creative Computing.  3 lectures, 1 laboratory.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE Area.\n"
    },
    "Computational Thinking for Educators": {
        "ID": "CSC312",
        "UNITS": "4",
        "DESC": "Fundamentals of computational thinking in the context of K-12 Education.  Ethical and social considerations of computing.  Data gathering and representation.  Logic and computational reasoning.  Data and procedural abstraction.  Problem decomposition.  Code patterns for algorithmic problem-solving.  Course may be offered in classroom-based, online, or hybrid format.  3 lectures, 1 laboratory.\n"
    },
    "Practical Computer Security for Everyone": {
        "ID": "CSC320",
        "UNITS": "4",
        "DESC": "Exploration of practical computer security in everyday life for non-majors.  Covering the principles, technologies and tools used to secure the Internet and keep ourselves digitally secure, including:  privacy and anonymity, web and data security, cryptography, malware, authentication and access control.  Course may be offered in classroom-based or online format.  3 lectures, 1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Sustainability and the Built Environment": {
        "ID": "CM317",
        "UNITS": "4",
        "DESC": "Interdisciplinary analysis of sustainable strategies and technologies to enhance the built environment.  A systems approach to green building science that includes sustainable site development, water use efficiency, renewable energy, improving material use, indoor environmental quality, and design innovation.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Housing and Communities": {
        "ID": "CM318",
        "UNITS": "4",
        "DESC": "An overview of the social, economic, environmental and cultural impacts of housing on communities and nations.  Students are presented with varied perspectives to understand the different facets of housing and their impacts on the human experience.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Dairy Manufacturing": {
        "ID": "DSCI229",
        "UNITS": "4",
        "DESC": "Composition and properties of fluid milk and manufactured milk products. Chemistry and microbiology of dairy products. Processes and equipment involved in the manufacture of butter, cheeses, and other fermented dairy products, frozen, condensed, and dried dairy foods. 3 lectures, 1 laboratory. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Active Wellness": {
        "ID": "DANC210",
        "UNITS": "4",
        "DESC": "Investigation of health and wellness ideologies and techniques through active participation in personalized fitness circuits and lectures. Basic elements of fitness, injury prevention, nutrition are presented to help students activate optimum health now and in the future. 3 lectures, 1 activity. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs).\n"
    },
    "Dance Appreciation": {
        "ID": "DANC221",
        "UNITS": "4",
        "DESC": "Introductory survey of major experiments in dance. Examination of history, philosophy, aesthetics, cultural context and criticism of diverse dance genres. Focus on major western dance artists from the 19th century to the present. Purchase of concert ticket(s) may be required. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Cultural Influence on Dance in America": {
        "ID": "DANC321",
        "UNITS": "4",
        "DESC": "Multicultural approach to history of dance in America, with emphasis on American Indian, West African, Caribbean, Mexican, European, and Asian contributions and influences.  Explores culture through dance.  Purchase of concert ticket(s) required.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Data Science for All I": {
        "ID": "DATA100",
        "UNITS": "4",
        "DESC": "Basic approaches for answering questions using data.  Emphasis on working with tabular data in spreadsheet software to provide insights via descriptions and visualizations.  Methods of acquiring data.  Sampling bias, variability, and multi-variable thinking.  Introduction to data modeling and data ethics.  Intended for students in non-computing disciplines.  Not open to students with credit in STATÂ 150, STATÂ 252, STATÂ 302, STATÂ 312, or STATÂ 313.  Course may be offered in a classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Soil, Water, and Civilization": {
        "ID": "ERSC335",
        "UNITS": "4",
        "DESC": "Explore past civilizations and how management of soil, water, and other natural resources allowed them to flourish, decline, or fail.  Sustainability of natural resource use in modern/future societies.  Issues include sustainability, agricultural practices, deforestation, water quality, and land management.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Survey of Economics": {
        "ID": "HNRS201",
        "UNITS": "4",
        "DESC": "Basic principles of microeconomics and macroeconomics. Emphasis on applications to current local, national and global economic issues. Not open to student with credit in ECONÂ 222. Course may be offered in classroom-based or hybrid format. 4 lectures. Crosslisted as ECON/HNRSÂ 201. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Macroeconomics": {
        "ID": "ECON222",
        "UNITS": "4",
        "DESC": "Introduction to macroeconomics including aggregate output, employment, inflation, and economic growth. Money and the monetary system. Macroeconomic policy including fiscal and monetary policy. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Economics of Poverty, Discrimination and Immigration": {
        "ID": "HNRS303",
        "UNITS": "4",
        "DESC": "Economic analysis of the cause, extent and impact of poverty, discrimination and immigration and of the policies designed to address these socioeconomic issues.  Emphasis on the experience of African-Americans, Latinos, and women in the United States.  4 lectures.  Crosslisted as ECON/HNRSÂ 303.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Comparative Economic Systems": {
        "ID": "ECON304",
        "UNITS": "4",
        "DESC": "Analysis of economic systems as a set of mechanisms and institutions for decision making, and the implementation of decisions regarding income distribution, the levels of consumption and production, and the level of economic welfare.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Microcontrollers for Everyone": {
        "ID": "EE322",
        "UNITS": "4",
        "DESC": "Microcontroller history and computer systems overview.  Introduction to basic electrical circuits and computer programming concepts.  3 lectures, 1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Writing and Rhetoric Stretch (Part II)": {
        "ID": "ENGL132",
        "UNITS": "4",
        "DESC": "Part two of a two-part stretch course sequence.  Rhetorical principles and strategies for producing effective writing.  Writing as a recursive process that leads to greater coherency, stylistic complexity, and rhetorical awareness.  Not open to students with credit in ENGLÂ 133 or ENGLÂ 134.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area A2 with a grade of C- or better (GE Area A1 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Multilingual Writing and Rhetoric": {
        "ID": "ENGL133",
        "UNITS": "4",
        "DESC": "Rhetorical principles of and strategies for producing effective academic writing for multilingual audiences.  Focus on genre awareness, responding to a range of rhetorical situations across multiple languages and cultures, and stylistic elements appropriate for bilingual and multilingual writers.  Not open to students with credit in ENGLÂ 134.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area A2 with a grade of C- or better (GE Area A1 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Writing and Rhetoric": {
        "ID": "ENGL134",
        "UNITS": "4",
        "DESC": "Rhetorical principles and strategies for producing effective writing.  Writing as a recursive process that leads to greater coherency, stylistic complexity, and rhetorical awareness.  Not open to students with credit in ENGLÂ 133.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area A2 with a grade of C- or better (GE Area A1 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Writing Arguments": {
        "ID": "HNRS145",
        "UNITS": "4",
        "DESC": "Examination of rhetorical principles and ethical rhetorical action.  Application of these principles and practices to arguments across a range of genres and media.  Evaluate credibility of evidence and sources.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as ENGL/HNRSÂ 145.  Fulfills GE Area A3 with a grade of C- or better.\n"
    },
    "Writing Arguments about STEM": {
        "ID": "HNRS147",
        "UNITS": "4",
        "DESC": "Critical analysis of arguments about STEM topics.  Examination and application of logical and rhetorical principles.  Evaluation of sources and evidence.  Composing arguments across a range of genres and media.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area A3 with a grade of C- or better.  Crosslisted as ENGL/HNRSÂ 147.\n"
    },
    "British Literature: Beginnings to 1789": {
        "ID": "ENGL230",
        "UNITS": "4",
        "DESC": "Covers a thousand years of British literature, from the eighth to the eighteenth century and may include such readings as Beowulf, The Canterbury Tales, Utopia, Othello, The Blazing World, Paradise Lost, Oroonoko and The Interesting Narrative of the Life of Olaudah Equiano.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area C2 (GE Area C1 for students on the 2019-20 or earlier catalogs).\n"
    },
    "British Literature: 1789 to the Present": {
        "ID": "HNRS232",
        "UNITS": "4",
        "DESC": "Broadly surveys Romantic, Victorian, Modern, and Contemporary British literature in an historical-cultural context.  Investigates works from several genres and a variety of national and cultural voices.  May include such writers as Wordsworth, Wollstonecraft, Dickens, G.  Eliot, Wilde, Woolf, Yeats, and Gordimer.  4 lectures.  Crosslisted as ENGLÂ 231/HNRSÂ 232.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "American Literature: Beginnings to 1865": {
        "ID": "ENGL241",
        "UNITS": "4",
        "DESC": "Survey of early U.S.  American literature from pre-Columbian era to end of Civil War.  A range of writers and genres, including Indigenous creation stories, early exploration documents, first contact narratives, colonial histories, sermons, poetry, essays, autobiographies, drama, and fiction.  Not open to students with credit in ENGL 240.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "American Literature: 1830 to the Present": {
        "ID": "HNRS242",
        "UNITS": "4",
        "DESC": "A broad survey of later U.S.  American literature from the rise of literary nationalism to the present.  A wide range of writers and genres, including novels, short stories, poems, plays, essays, and autobiographies.  Not open to students with credit in ENGL 240.  Course may be offered in classroom-based or online format.  4 lectures.  Crosslisted as ENGL/HNRSÂ 242.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Classical Literature": {
        "ID": "HNRS251",
        "UNITS": "4",
        "DESC": "Examination of the ancient epics and classical literature of Mesopotamia, Greece, and Rome.  May include such readings as The Epic of Gilgamesh, the Iliad, the Odyssey, Genesis, Sappho's Poetry, Antigone, the Symposium, the Aeneid, and Marcus Aurelius's Meditations.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as ENGL/HNRSÂ 251.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Medieval through Enlightenment Literature": {
        "ID": "ENGL252",
        "UNITS": "4",
        "DESC": "Examination of key works marking the transition from Mediterranean Classicism (c.  500 CE) to an emergent European tradition (c.  1800 CE).  May include such readings as Confessions, Beowulf, Lais of Marie de France, Oroonoko, Life of Olaudah Equiano, and Faust.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area C2 (GE Area C1 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Romantic through Modernist Literature": {
        "ID": "ENGL253",
        "UNITS": "4",
        "DESC": "Examination of major works from the Age of Revolution, beginning with the Romantics at the end of the eighteenth century and concluding with the Modernists of the late-twentieth century.  Considers the relationship between literary revolution, political revolution, and colonial-capitalist expansion.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Children's Literature in a Diverse Society": {
        "ID": "LS255",
        "UNITS": "4",
        "DESC": "Culturally diverse children's literature with a focus on analysis and evaluation of literary elements and structures, critical perspectives, trends, and issues.  A wide range of authors, genres and formats including folktales, fantasy, poetry, informational, historical and realistic fiction books.  Course may be offered in classroom-based or online format.  4 lectures.  Crosslisted as ENGL/LSÂ 255.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introductory Topics in Cinematic Expression": {
        "ID": "ENGL272",
        "UNITS": "4",
        "DESC": "Active viewing and critical analysis of cinema from the silent era to today as revealing and changing our cultural values.  Study of narrative structures, cinematic techniques such as cinematography, editing, and sound, technological innovations, and contributions made by many different communities and individuals.  The Class Schedule will list topic selected.  3 lectures, 1 laboratory.  Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Advanced Rhetorical Inquiry and Composing": {
        "ID": "ENGL311",
        "UNITS": "4",
        "DESC": "Analysis of multi-genre and multi-modal pieces.  Focus on rhetorical strategies implemented across disciplines, histories, cultures.  Rhetoric, persuasion, and composing will be studied as an art form and a humanistic endeavor.  Not open to students with credit in ENGL 302 or ENGLÂ 312.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Translingual Rhetorical Inquiry and Writing": {
        "ID": "ENGL312",
        "UNITS": "4",
        "DESC": "Writing and analysis of multi-genre and multi-modal projects for bilingual and multilingual audiences.  Focus on rhetorical strategies writers implement across disciplines, histories, cultures.  Rhetoric studied as an art form.  Field trip may be required.  Not open to students with credit in ENGL 302 or ENGLÂ 311.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Writing Sustainability, Resilience, and Equity": {
        "ID": "ENGL315",
        "UNITS": "4",
        "DESC": "Place-based writing course investigating the social and humanistic impacts of environmental issues and sustainability.  Writing in the major genres of social life cycle assessment and a final research paper.  Instruction in designing effective data visualizations.  Field trip may be required.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Writing Sustainability": {
        "ID": "ENGL316",
        "UNITS": "4",
        "DESC": "Place-based writing course investigating the social and humanistic impacts of environmental issues and sustainability.  Writing in the major genres of social life cycle assessment and a final research paper.  Instruction in designing effective data visualizations.  Field trip may be required.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "British Literature: Beginnings to 1485": {
        "ID": "ENGL330",
        "UNITS": "4",
        "DESC": "The historical development of medieval English literature through selected canonical and non-canonical works of various genres.  Medieval authorship and textual practice, the relationship between gender and writing, and the forging of a national poetic identity.  Interdisciplinary support material (artwork and music) illustrating key themes.  Course may be offered in classroom-based or online format.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "British Literature: 1485-1660": {
        "ID": "ENGL331",
        "UNITS": "4",
        "DESC": "The literary, historical, political, religious and scientific concerns of the Age of the Renaissance.  May include such readings as More's Utopia, Spenser's Faerie Queene, Shakespeare's Othello, Donne's Songs and Sonnets, Milton's Paradise Lost.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "British Literature: 1660-1798": {
        "ID": "HNRS332",
        "UNITS": "4",
        "DESC": "In-depth exploration of the dominant themes and preoccupations of the Age of Enlightenment.  Historical and cultural contexts of canonical and non-canonical literature emphasized to illustrate 18th century Britons' views of themselves and their changing world.  May include such writers as Dryden, Behn, Defoe, Swift, Pope, and Johnson.  4 lectures.   Crosslisted as ENGL/HNRSÂ 332.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "British Literature: 1798-1832": {
        "ID": "HNRS333",
        "UNITS": "4",
        "DESC": "In-depth exploration of the literature of the British Romantic period.  Cultural, historical, and philosophic contexts will also be examined in both canonical and non-canonical works.  May include such writers as Blake, Wordsworth, Keats, and Wollstonecraft.  4 lectures.   Crosslisted as ENGL/HNRSÂ 333.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "British Literature: 1832-1914": {
        "ID": "ENGL334",
        "UNITS": "4",
        "DESC": "In-depth study of historical, philosophical, and literary reaction to the rise of the modern industrial state.  Special focus on the literary response to the following:  industry, democracy, class, art, and culture.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "British Literature: 1914-Present": {
        "ID": "ENGL335",
        "UNITS": "4",
        "DESC": "In-depth exploration of the dominant concerns and achievements of British literature from Modernism through Postmodernism.  Historical and cultural contexts of canonical and non-canonical literature explored to illustrate 20th century Britain's reactions to the breakdown of traditional beliefs, the World Wars, the legacy of colonialism, the changing politics and problems of a multicultural nation.  May include such writers as Conrad, Joyce, Woolf, Yeats, Heaney, Ishiguro, Walcott.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Introduction to Shakespeare": {
        "ID": "ENGL339",
        "UNITS": "4",
        "DESC": "Shakespeare's works as texts, productions and major historical, aesthetic and cultural touchstones.  The author's intellectual and social influences on four centuries of theatre and his subsequent impact on literature and other arts.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "American Literature: Beginnings-1865": {
        "ID": "ENGL340",
        "UNITS": "4",
        "DESC": "The literature of the United States from its sources in the accounts of the early British and Spanish explorers to the works of the American Renaissance.  The relationship between mainstream and marginalized voices in the American character.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "American Literature: 1865-1914": {
        "ID": "HNRS341",
        "UNITS": "4",
        "DESC": "Analysis of literary Realism and Naturalism in their cultural and historical contexts.  May include such writers as Whitman, Dickinson, Twain, Chopin, James, Wharton, Dreiser, Norris, and Crane who are seen to accommodate the sense of danger, doubt, and disorder of the time.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "American Literature: 1914-1956": {
        "ID": "HNRS342",
        "UNITS": "4",
        "DESC": "The writers of the modern period and those of the early post-modern age, including writers marked by stylistic innovation and a willingness to challenge traditionally accepted standards.  May include such writers as Hemingway, Fitzgerald, Stein, Hughes.  4 lectures.   Crosslisted as ENGL/HNRSÂ 342.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "American Literature: 1956-Present": {
        "ID": "HNRS343",
        "UNITS": "4",
        "DESC": "In-depth study of American fiction, poetry, and drama written since 1956.  How contemporary literature examines enduring American themes and breaks new ground with the inclusion of diverse voices.  4 lectures.   Crosslisted as ENGL/HNRSÂ 343.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Women Writers of the Twentieth and Twenty-First Centuries": {
        "ID": "HNRS345",
        "UNITS": "4",
        "DESC": "In-depth exploration of works of 20th and 21st century women authors within their historical and cultural contexts.  Analysis of canonical and non-canonical writing by women of differing classes, races, ethnicities, and sexual orientations.  Literary techniques through which texts reflect or challenge such cultural constructs as gender, identity, sexuality, motherhood, etc.  The emergence of a female literary tradition.  May include such writers as Adichie, Aoki, Lorde, Mukherkee, Olds, Rich.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Crosslisted as ENGL/HNRSÂ 345.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "Ethnic American Literature": {
        "ID": "ENGL346",
        "UNITS": "4",
        "DESC": "Investigation of the primary issues, themes, and tropes of literature written in English by African-American, Asian-American, Native American, Hispanic and Jewish writers.  Cultural and historical contexts explored to consider effects of marginalization on this literature, and its subsequent relation to the American canon.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "African American Literature": {
        "ID": "HNRS347",
        "UNITS": "4",
        "DESC": "The writings of African Americans from the end of the eighteenth century to the present.  Individual works and literary trends among African Americans of various periods and contexts:  intellectual, political, and cultural.  Course may be offered in classroom-based or online format.  4 lectures.   Crosslisted as ENGL/HNRSÂ 347.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "Asian American Literature": {
        "ID": "ENGL348",
        "UNITS": "4",
        "DESC": "Investigation of the primary concerns, themes, and historical, cultural, and sociopolitical contexts of literature produced by people of West Asian, East Asian, South Asian, and/or Southeast Asian descent in the United States.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "Gender in Twentieth and Twenty-First Century Literature": {
        "ID": "ENGL349",
        "UNITS": "4",
        "DESC": "In-depth study of issues related to male and female identity and the relations between men and women as depicted in 20th and 21st century fiction, poetry, non-fiction, and/or drama.  How gender issues are created and viewed from different perspectives, such as social/economic class, ethnicity, and sexual orientation.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "The Modern Novel": {
        "ID": "ENGL350",
        "UNITS": "4",
        "DESC": "Readings in the modern novel in its historical and cultural context.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Modern Poetry": {
        "ID": "ENGL351",
        "UNITS": "4",
        "DESC": "Modern poetry, considered in its historical and cultural context.  The rise of experimental styles designed to reflect the disorder of the twentieth century - fragmentation, alienation, dislocation, and the absence of connections.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Modern Drama": {
        "ID": "HNRS352",
        "UNITS": "4",
        "DESC": "Reading and analysis of world drama of the last 150 years, thereby enhancing student awareness of modern culture, history, ethics, politics, and the human condition.  Design work, multi-media forms, art, music, and cinema as components or informing elements of the works under consideration.  4 lectures.   Crosslisted as ENGL/HNRSÂ 352.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "The Bible as Literature and in Literature and the Arts": {
        "ID": "ENGL354",
        "UNITS": "4",
        "DESC": "The most important and representative books of the Bible.  Exposure to works based on the Bible in literature, painting, sculpture, architecture, music, and film.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "World Cinema": {
        "ID": "ENGL370",
        "UNITS": "4",
        "DESC": "Major works of international cinema with emphasis on critical interpretation, on the ways film communicates visually and aurally, and on the historical and cultural contexts in which films are created.  3 lectures, 1 laboratory.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Film Styles and Genres": {
        "ID": "ENGL371",
        "UNITS": "4",
        "DESC": "Major films within particular cinematic genres or styles, with emphasis on critical interpretation, aesthetic appreciation, and the films' historical and cultural contexts.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  3 lectures, 1 laboratory.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Film Directors": {
        "ID": "ENGL372",
        "UNITS": "4",
        "DESC": "Films of one or more major film directors, with emphasis on critical interpretation, aesthetic appreciation, and the films' historical and cultural contexts.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  3 lectures, 1 laboratory.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Topics on Gender Representations in Film": {
        "ID": "ENGL373",
        "UNITS": "4",
        "DESC": "Focus on how films reinforce and challenge gender norms.  Films will be studied through an intersectional lens.  Attention given to technical elements of filmmaking, film criticism, and film history.  The Class Schedule will list topic selected.  3 lectures, 1 laboratory.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Disability and Diversity in American Film": {
        "ID": "ENGL374",
        "UNITS": "4",
        "DESC": "An overview of cinematic representations of disability in film within the United States.  Emphases on critical interpretation, history, aesthetics, and sociocultural contexts.  Field trip may be required.  Course may be offered in classroom-based, online, or hybrid format.  3 lectures, 1 laboratory.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); GWR; and USCP.\n"
    },
    "Literary Themes": {
        "ID": "HNRS380",
        "UNITS": "4",
        "DESC": "Literature selected according to a particular theme.  Emphasis on critical interpretation, aesthetic appreciation, and historical and cultural contexts.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Crosslisted as ENGL/HNRSÂ 380.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and GWR.\n"
    },
    "Diversity in Twentieth and Twenty-First Century American Literature": {
        "ID": "ENGL381",
        "UNITS": "4",
        "DESC": "Literature selected according to a particular theme, with a focus on issues of ethnicity and gender.  Emphasis on critical interpretation, aesthetic appreciation, and historical and cultural contexts.  The Schedule of Classes will list topic selected.  Total credit limited to 12 units.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "LGBT Literature and Media": {
        "ID": "ENGL382",
        "UNITS": "4",
        "DESC": "Representations of lesbian, gay, bisexual, transgendered (LGBT) individuals and issues, late 19th century to the present.  Topics include the closet, homophobia, coming out, AIDS, same-sex marriage, intersections of sexuality, race, class, gender identity.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); USCP; and GWR.\n"
    },
    "Creative Nonfiction": {
        "ID": "ENGL386",
        "UNITS": "4",
        "DESC": "Writing creative nonfiction (the memoir, the nature essay, the personal narrative, cultural criticism, literary journalism) by adding composition skills of fictional and poetic techniques.  A publication workshop.  Total credit limited to 8 units.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Fiction Writing": {
        "ID": "ENGL387",
        "UNITS": "4",
        "DESC": "How to write and read fiction.  Exploring and understanding the elements of fiction writing, employing models by established writers.  Total credit limited to 8 units.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Poetry Writing": {
        "ID": "ENGL388",
        "UNITS": "4",
        "DESC": "How to write and read poetry.  Exploring a variety of formal options, employing model poems by established writers and identifying and enhancing what is best in poetry written in class.  Total credit limited to 8 units.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Principles of Environmental Design": {
        "ID": "EDES123",
        "UNITS": "4",
        "DESC": "How design relates and impacts environmental and social justice, equity, identity, community, and well-being.  Design thinking, process, and tools in describing and planning the built environment.  Divergent and inclusive thinking, engaging multiple publics, and expert knowledge in planning and design.  Course may be offered in classroom-based or online format.  2 lectures, 2 discussions.  Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs).\n"
    },
    "Engineering for the Environment": {
        "ID": "ENVE323",
        "UNITS": "4",
        "DESC": "Societal importance of air and water quality and land resources.  Pollutant transport and treatment technologies, including the scientific basis for these technologies.  Local examples of applied pollution control technologies to meet regulatory requirements.  Field trip required.  Not for engineering majors.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Introduction to Air Pollution": {
        "ID": "ENVE324",
        "UNITS": "4",
        "DESC": "Causes and effects of air pollution on the individual, the community and industry.  Legal and economic aspects.  For non-majors.  Not open to students in engineering or computer science.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Race, Culture, and Politics in the United States": {
        "ID": "HNRS112",
        "UNITS": "4",
        "DESC": "Interdisciplinary study of race and ethnicity as created by historical processes and American institutions (social, political, economic, legal and cultural institutions). Attention to interlocking systems of race, class, gender and sexuality. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Crosslisted as ES/HNRSÂ 112. Fulfills GE D1 and USCP.\n"
    },
    "Writing & Rhetoric": {
        "ID": "ES134",
        "UNITS": "4",
        "DESC": "Writing and rhetorical strategies and practices that produce sound academic writing; foregrounds a process-based, recursive approach to writing. 4 Lectures. Fulfills GE Area A2 with a grade of C- or better (GE Area A1 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Reasoning, Argumentation, & Writing": {
        "ID": "ES145",
        "UNITS": "4",
        "DESC": "Principles of reasoning and argumentation.  Application of these principles to written and oral communication.  Effective use of research methods and sources.  4 lectures.   Fulfills GE Area A3 with a grade of C- or better.\n"
    },
    "Chicano/a Non-Fiction Literature": {
        "ID": "ES300",
        "UNITS": "4",
        "DESC": "Overview of contemporary Chicano/a non-fiction literature since 1848.  Thematic concerns, literary criticism, literary techniques, historical and socio-cultural factors influencing non-fiction Chicano/a literary genres.  Instructor reserves option to select non-fiction genres to be studied.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Latina/o Literature of the United States": {
        "ID": "ES301",
        "UNITS": "4",
        "DESC": "Latina/o literature written by/for/about Latinas/os in the United States.  Topics include literary representation of Latinos/as in the U.S.  related to race/ethnicity, gender, sexuality, class, etc.  Primary focus on Latina/o literary texts in the mid 20th to early 21st centuries.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Chicana/o Literature": {
        "ID": "ES302",
        "UNITS": "4",
        "DESC": "Chicana/o literature written by/for/about Chicanas/os in the United States.  Topics include literary representation of Chicanos/as in the U.S.  related to race/ethnicity, gender, sexuality, class, etc.  Primary focus on Chicana/o literary texts in the mid 20th to early 21st centuries.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Latina/o Poetry and Politics": {
        "ID": "ES303",
        "UNITS": "4",
        "DESC": "Significant Latinx/a/o poetry and poetics from the 19th century to the present.  Topics include genre, form, content, politics, and poetics of Latina/o writers of poetry; comparisons/contrasts of different Latina/o ethnic poets and their poetry in different historical periods.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Fire and Society": {
        "ID": "NR308",
        "UNITS": "4",
        "DESC": "Prehistorical and historical record of human use of and attitude toward fire.  Mythology and religion of fire.  Traditional, cultural and ethnic variations and their influence on modern U.S.  institutions involved in managing fire.  Course may be offered in classroom-based or online format.  4 lectures.  Crosslisted as ES/NRÂ 308.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Hip-Hop, Poetics and Politics": {
        "ID": "ES310",
        "UNITS": "4",
        "DESC": "Dynamics of hip-hop culture, its historical development, political significance, and social influence.  How hip-hop exemplifies cross-cultural hybridization within not only Black communities nationally and internationally, but also amongst indigenous, Latino/a, and Asian peoples in the U.S.  and beyond.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "BeyoncÃ©: Race, Feminism and Politics": {
        "ID": "ES311",
        "UNITS": "4",
        "DESC": "Employing an Ethnic Studies lens, BeyoncÃ© body of work and image will serve as a lens through which to explore pop constructions and representations of race, gender, and sexuality as well as the use of those intersecting identities as political tools.  4 lectures.\n"
    },
    "African Americans in Popular Culture": {
        "ID": "ES320",
        "UNITS": "4",
        "DESC": "Cultural studies analysis of the representations of, and counter-representations by, American racial/ethnic groups, with particular emphasis on African Americans.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Native Americans in Popular Culture": {
        "ID": "ES321",
        "UNITS": "4",
        "DESC": "Cultural studies analysis of the representations of, and counter-representations by racial/ethnic groups, with particular emphasis on Native Americans.  The cultural images of Native peoples in the United States that have characterized relationships.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Asian Americans in Popular Culture": {
        "ID": "ES322",
        "UNITS": "4",
        "DESC": "Cultural studies analysis of the representations of, and counter-representations by, American racial/ethnic groups, with particular emphasis on Asian-Americans.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Latina/os in Popular Culture": {
        "ID": "ES323",
        "UNITS": "4",
        "DESC": "Cultural studies analysis of the representations (racializing images and discourses) of, and counter-representations by, American cultural/ethnic groups with particular emphasis on Mexican Americans/Latinos.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Chicana/o Film": {
        "ID": "ES324",
        "UNITS": "4",
        "DESC": "Exploration of how Chicanas/os and their experiences are represented in major films by/for/about them in the United States.  Topics include visual/popular culture and film theories, race and representation; film genre; key film concepts.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "The Chinese American Experience": {
        "ID": "ES330",
        "UNITS": "4",
        "DESC": "History and current status of Chinese Americans, with emphasis on the international contexts, organizations and institutions of Chinese America, and on Chinese Americans' demographic compositions, spatial patterns, and cultural, socioeconomic, and political adaptation experiences.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "The Filipina/o American Experience": {
        "ID": "ES335",
        "UNITS": "4",
        "DESC": "An interdisciplinary examination of the historical development of Filipina/o American identities and communities.  The social, cultural and political institutions that have influenced Filipina/o immigration, participatory citizenship, activism and cultural practices.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Cultural Production and Ethnicity": {
        "ID": "ES340",
        "UNITS": "4",
        "DESC": "Culture and ethnicity as key factors in the production, perception, and interpretation of art and the humanities.  Critical analysis of cultural attitudes and knowledge in expressive arts and cultural production, and of the contexts of cultural production as reflective of ethnicity.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Queer Ethnic Studies": {
        "ID": "WGQS345",
        "UNITS": "4",
        "DESC": "Theories, research and methods focused on the interlocking systems of sexuality, race, racialization, and ethnicity in local, national and comparative global/transnational contexts.  Relationships between racialization and heteronormativity; queer of color critique; queer migration; decolonizing queer organizing, theory, and knowledge production.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as ES/WGQSÂ 345.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.  Formerly WGS 345.\n"
    },
    "Gender, Race, Culture, Science & Technology": {
        "ID": "WGQS350",
        "UNITS": "4",
        "DESC": "Examines the complex relationships between gender, race, culture, science, and technology via intersectional quantitative and qualitative inquiry, centering the perspectives/contributions of historically marginalized people in the U.S.  Explores, evaluates, and develops proposals to create more diverse, equitable, ethical, humane science/technology.  Course may be offered in classroom-base, online, or hybrid format.  3 lectures, 1 activity.  Crosslisted as ESÂ 350/HNRSÂ 353/WGQSÂ 350.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog); and USCP.  Formerly WGS 350.\n"
    },
    "Gender, Race, Class, Nation in Global Engineering, Technology & International Development": {
        "ID": "WGQS351",
        "UNITS": "4",
        "DESC": "Cross-cultural exploration of the intersections of gender, race, class, nation in the global engineering workforce, small- and large-scale technological systems, and international development programs; special attention to 21st century challenges and efforts to create more socially responsible engineering and technology.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as ES/WGQSÂ 351.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).  Formerly WGS 351.\n"
    },
    "Ethnicity and the Land": {
        "ID": "NR360",
        "UNITS": "4",
        "DESC": "Comparative study of how race and culture shape landscapes, and how social hierarchies allocate the use of natural resources and the burdens of environmental pollution.  4 lectures.   Crosslisted as ES/NRÂ 360.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Critical Race Theory": {
        "ID": "ES380",
        "UNITS": "4",
        "DESC": "History and evolution of the critical race theory movement.  Defining issues of the field; in particular, the relationship between race, power and the law.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "The Social Construction of Whiteness": {
        "ID": "ES381",
        "UNITS": "4",
        "DESC": "The investigation of the social construction of race in the United States through historicizing the category of 'whiteness.' Why 'white' was invented as a racial category and how white privilege has been sustained through social, political, economic and legal practices.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Food and Nutrition: Culture and Customs": {
        "ID": "FSN250",
        "UNITS": "4",
        "DESC": "Anthropological perspective of traditional and contemporary food customs and culture. Major emphasis on U.S. cultures including Native American, Hispanic American, African American, and Asian American. Opportunities to explore personal cultural food experiences. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs) and USCP.\n"
    },
    "Nutrition & Exercise for Health & Disease Prevention": {
        "ID": "FSN305",
        "UNITS": "4",
        "DESC": "Introduction, integration, and application of nutrition and exercise sciences and recommendations for attaining health and preventing disease development, including obesity, diabetes, and cardiovascular disease.  Development of personalized diet and exercise plan for health and disease prevention.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "The Science of Food for the Consumer": {
        "ID": "FSN319",
        "UNITS": "4",
        "DESC": "Overview of the science and processes used to produce the foods consumed on a daily basis.  Food science, biotechnology, food law, processing, preservation, ingredient functionality, package label information, and food safety information.  Course may be offered in classroom-based or online format.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Fermented Foods": {
        "ID": "FSN340",
        "UNITS": "4",
        "DESC": "Processing, manufacturing, historical and bio-technical applications of fermentation technology for the production of food and beverages.  Wines of the world, distilled beverages, beers, fermented dairy, vegetable and meat products important to the post-harvest economy of California.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Critical Reading in French Literature": {
        "ID": "FR233",
        "UNITS": "4",
        "DESC": "Selected readings in French from Francophone authors that illustrate the French literary tradition from the Middle Ages to the present in both France and other French-speaking countries.  May include film and other media.  Conducted in French.  4 lectures.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Significant Works in French": {
        "ID": "FR305",
        "UNITS": "4",
        "DESC": "Critical analysis and oral discussion of poetry, essays, novels, plays, films, and other media by selected French and Francophone authors.  Conducted in French.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  4 lectures.   Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "French Literature in English Translation": {
        "ID": "FR350",
        "UNITS": "4",
        "DESC": "Selected works to be read by students in English translation.  Critical analysis, interpretation, and comparison of works by French and/or Francophone authors.  Course may include film and other media.  Discussion in English.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Human Geography": {
        "ID": "GEOG150",
        "UNITS": "4",
        "DESC": "The interplay of cultures, places, and environments, with emphasis on diversity and globalization. Topics include characteristics and patterns of human population, migration, ethnicity, agriculture, geopolitics, language, religion, urbanization, industry, and international development. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Global Geography": {
        "ID": "GEOG308",
        "UNITS": "4",
        "DESC": "Examination of the major world regions such as Europe, the Middle East, Africa, Asia and Latin America.  Focus on the origins and content of contemporary cultural landscapes and on their utility for understanding international differences, interactions, and current events.  Particular attention to the relationship between humans and the environment.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Geography of Latin America": {
        "ID": "GEOG370",
        "UNITS": "4",
        "DESC": "Geographic analysis of the lands and peoples of Mexico, Central America, the Caribbean, and South America.  Patterns of environment, culture, politics, economy, and development.  Issues (local, regional, and global) shaping Latin America today, with emphasis on U.S.-Latin America relations.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Geography of the Caribbean": {
        "ID": "GEOG380",
        "UNITS": "4",
        "DESC": "Geographic analysis of the Caribbean including the Greater Antilles, Lesser Antilles, and the Caribbean coasts of Central and South America.  Investigates patterns and relationships between the physical and cultural geographies from local, regional, and global perspectives.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Geology": {
        "ID": "GEOL102",
        "UNITS": "4",
        "DESC": "Processes responsible for the Earth's minerals, rocks, structure, and surface features. Volcanism; mountain building; plate tectonics; weathering. Erosion and deposition by streams, glaciers, wind and waves. Geological resources, earth hazards, and interaction of humanity with global processes. 3 lectures, 1 discussion. Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The Geologic Record: Fossils and the History of Life": {
        "ID": "GEOL203",
        "UNITS": "4",
        "DESC": "A historical account of life on Earth interpreted from the fossil record. Paleoenvironmental controls on the rise and decline of lineages of organisms deduced from stratigraphy, and from the composition, character, and geochemistry of sedimentary rocks. Identification of fossils. 3 lectures, 1 discussion. Fulfills GE Area B1 (GE Area B5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Seismology and Earth Structure": {
        "ID": "GEOL305",
        "UNITS": "4",
        "DESC": "Elastic waves in layered media.  Principle of the seismometer.  Magnitude, seismic moment and energy calculations.  Source mechanics.  Major California faults and paleoseismology.  Theory of plate tectonics.  Seismic properties, structure, and composition of the Earth.  Field trip required.  3 lectures, 1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Critical Readings in German Literature": {
        "ID": "GER233",
        "UNITS": "4",
        "DESC": "Selected readings from German-language authors encompassing the literary tradition from the Middle Ages to the present.  May include film and other media.  Conducted in German.  4 lectures.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Significant Works in German": {
        "ID": "GER305",
        "UNITS": "4",
        "DESC": "Critical analysis and oral discussion of poetry, essays, novels, plays, films, and other media by selected German-language authors.  Conducted in German.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "German Literature in English Translation": {
        "ID": "GER350",
        "UNITS": "4",
        "DESC": "Selected works to be read by students in English translation.  Critical analysis, interpretation, and comparison of works by German-language authors.  Course may include film and other media.  Discussion in English.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Healthy Living": {
        "ID": "HLTH250",
        "UNITS": "4",
        "DESC": "Personal health with emphasis on healthful behavioral practices including physical fitness, nutrition, psychosocial well-being, alcohol and other drugs, intentional and unintentional injury, reproductive health, infectious and non-infectious diseases. Not open to students with credit in HLTH/KINE 255. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs).\n"
    },
    "Personal Health: A Multicultural Approach": {
        "ID": "HLTH255",
        "UNITS": "4",
        "DESC": "Personal health with special emphasis on multicultural practices. Not open to students with credit in HLTH/KINE 250. Course may be offered in a classroom-based or online format. 4 lectures. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs); and USCP.\n"
    },
    "Women's Health Issues": {
        "ID": "HLTH260",
        "UNITS": "4",
        "DESC": "Introduction to major health issues that affect women disproportionately or differently from men. Topics include female sexual health and reproduction, exercise and eating behaviors, substance abuse, mental health and stress, and violence against women. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs); and USCP.\n"
    },
    "Global Health": {
        "ID": "HLTH410",
        "UNITS": "4",
        "DESC": "Application of the social determinants of health to global health problems.  Particular attention to disparities, national and international policies, health systems, and resource availability and utilization.  Overview of the history of global health including the impact of colonization in the field - past, present, and future.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.\n"
    },
    "Health Education for Teachers": {
        "ID": "HLTH443",
        "UNITS": "4",
        "DESC": "Health status, special concerns and national health objectives for school aged children; coordinated school health programs and Health Framework for CA public schools .  Health literacy, nutrition, safety, alcohol, tobacco and other drugs, reproductive health, and chronic disease prevention.  4 lectures.\n"
    },
    "United States History to 1865": {
        "ID": "HNRS203",
        "UNITS": "4",
        "DESC": "Survey of the first half of U.S. history, including: contact and settlement, American Revolution, slavery, westward expansion, early California, Civil War, and California and U.S. Constitutions. Particular attention to how race, class, and gender shaped changing definitions of freedom and equality. Not open to students with credit in HISTÂ 206. 4 lectures. Crosslisted as HISTÂ 201/HNRSÂ 203. Fulfills GE Area D1 and USCP.\n"
    },
    "United States History Since 1865": {
        "ID": "HNRS202",
        "UNITS": "4",
        "DESC": "Survey of the second half of U.S. history, including reconstruction, industrialization, the regulatory state, foreign affairs, and the remaking of citizenship rights and society. Particular attention to how race, class, and gender shaped changing definitions of freedom and equality. Not open to students with credit in HISTÂ 206. Course may be offered in classroom-based or online format. 4 lectures. Crosslisted as HIST/HNRSÂ 202. Fulfills GE Area D1 and USCP.\n"
    },
    "United States Cultures": {
        "ID": "HIST206",
        "UNITS": "4",
        "DESC": "The social, cultural, constitutional, and political history of African American, Asian American, Native American, Latinx and other underrepresented groups. Not open to students with credit in HISTÂ 201 or HISTÂ 202. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area D1 and USCP.\n"
    },
    "World History to 1800": {
        "ID": "HIST210",
        "UNITS": "4",
        "DESC": "Global history from the beginnings of organized agriculture to the Industrial Revolution. Focus on causation, using geography and cultural creation to highlight economic, political, social, and intellectual developments of the major civilizations of earth. Not open to students with credit in HISTÂ 221 or HISTÂ 222. Field trip may be required. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern Political Economy": {
        "ID": "HNRS213",
        "UNITS": "4",
        "DESC": "The relationship between states and economies in the modern period. Modernization, industrialization, and colonialism. Modern systems of political economy, especially mercantilism, capitalism, communism, and social democracy. Modern theories of political economy, especially liberalism, Marxism, and Keynesianism. Course may be offered in classroom-based or online format. 4 lectures. Crosslisted as HIST/HNRSÂ 213. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Comparative Social Movements": {
        "ID": "HNRS216",
        "UNITS": "4",
        "DESC": "History of social movements worldwide from the late nineteenth century to the present. May include, but not limited to: socialism and other labor movements, feminism, white supremacy, pacifism, decolonization, Indigenous peoples, racial justice, LGBTQIA, environmentalism, fair trade, and independent living movement. 4 lectures. Crosslisted as HIST/HNRSÂ 216. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "World History, Beginnings to 1000 CE": {
        "ID": "HIST221",
        "UNITS": "4",
        "DESC": "History of world societies in comparative global perspective. Cross-cultural exchange, interaction, and conflict in the making of the world to 1000, concentrating on the rise of earliest human communities, growth of states, economic, political, and cultural transformations. Not open to students with credit in HISTÂ 210. Field trip may be required. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "World History, 1000-1800": {
        "ID": "HIST222",
        "UNITS": "4",
        "DESC": "History of world societies in comparative global perspective. Cross-cultural exchange, interaction, and conflict in the making of the world to 1800, concentrating on the global interaction and integration, cultural and ecological exchange, economic, political, and cultural transformations. Not open to students with credit in HISTÂ 210. Field trip may be required. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "World History, 1800 - Present": {
        "ID": "HNRS223",
        "UNITS": "4",
        "DESC": "Comparative history of Western and non-Western societies in global perspective. Examines the history of cross-cultural exchange, interaction, and conflict in the making of the modern world, concentrating on economic, political, and cultural transformations that facilitated and emerged from imperialism. Course may be offered in classroom-based or online format. 4 lectures. Crosslisted as HIST/HNRSÂ 223. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The World at War": {
        "ID": "HIST225",
        "UNITS": "4",
        "DESC": "Comparative history of the causes and consequences of global warfare for diverse societies and individuals from prehistory to the present. Relationships between global warfare and environment, technology, migration, economics, politics, religion, art, popular culture, law, ethnicity, class, and gender. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The Witch-Hunts in Europe, 1400-1800": {
        "ID": "HIST306",
        "UNITS": "4",
        "DESC": "A history of the development of witchcraft ideas, persecutions, and skepticism in the western world from 1400 to 1800, focusing on the legal, economic, social, and intellectual currents that produced, fired, and eventually ended the phenomenon.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "European Thought 1800-2000": {
        "ID": "HIST307",
        "UNITS": "4",
        "DESC": "Intellectual and cultural history of Europe from the nineteenth century to the present.  Liberalism, radical thought, feminism, evolutionary theory, psycho-analysis, structuralism, existentialism, and postmodernism.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The Trans-Atlantic Slave Trade": {
        "ID": "HNRS308",
        "UNITS": "4",
        "DESC": "The African, Islam and Euro-American dimensions of the trans-Atlantic slave trade, with focus on its varying roots, organization and impact on cross-cultural and global levels.  4 lectures.   Crosslisted as HIST/HNRSÂ 308.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Cultures of West Africa and the African Diaspora": {
        "ID": "HIST309",
        "UNITS": "4",
        "DESC": "The cultures of West African and the African Diaspora, with special attention to the intersection of Animist, Islamic and Western cultures, and the survival of African cultures in the Americas as manifested in the artistic, religious, literary, and other humanistic legacies of the African Diaspora.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "East Asian Culture and Civilization": {
        "ID": "HNRS312",
        "UNITS": "4",
        "DESC": "The pre-modern and modern histories of China and Japan.  Focus on the traditional era, the transition to modernity, cultural uniqueness within East Asian civilization, and western images of Asia.  4 lectures.   Crosslisted as HISTÂ 310/HNRSÂ 312.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Comparative World Environmental History & Sustainability Since 1492": {
        "ID": "HIST311",
        "UNITS": "4",
        "DESC": "Comparative history of landscape transformation, conservation policy, and environmental beliefs of North America, Latin America, Europe, China, and Africa from 1492 to the late 20th century.  Historical comparison of biophysical, cultural, economic, and political change connected to issues of sustainability in world regions.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern Middle East": {
        "ID": "HIST313",
        "UNITS": "4",
        "DESC": "Political, social, and economic development of the Middle East from the late Ottoman and Qajar Empires in the 19th century through the formation of nation-states in the 20th.  Special attention to imperialism, nationalism, orientalism, modernity/modernization, state-building, revolution, and oil.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).  Formerly HIST 314.\n"
    },
    "Modern East Asia": {
        "ID": "HIST316",
        "UNITS": "4",
        "DESC": "Modern histories of China, Japan and Korea:  great disruptions of modernity that have transformed these societies, common characteristics of modernity in East Asia, great differences between Chinese, Japanese and Korean histories, and the mutually constitutive nature of these East Asian histories.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The Lure of the Sea": {
        "ID": "HNRS317",
        "UNITS": "4",
        "DESC": "The history of the sea, people who travel across it, live alongside or in the midst of it, or simply seek it out.  Topics include imperialism, maritime commerce, port cities, littoral societies, piracy, tourism, popular culture.  4 lectures.   Crosslisted as HIST/HNRSÂ 317.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The City in the Modern World": {
        "ID": "HIST318",
        "UNITS": "4",
        "DESC": "Comparative history of social, economic, political, and cultural changes in urban life during the nineteenth and twentieth centuries.  Topics may include but are not limited to:  commerce and labor; disease and death; conservation and preservation; gender and sexuality; race and ethnicity.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern South and Southeast Asia": {
        "ID": "HIST319",
        "UNITS": "4",
        "DESC": "Modern histories of South and Southeast Asia:  traditional empires and cultures, spread of modern capitalism, Western and Japanese colonialism, decolonization and independence, ethnic and religious tensions, roles in contemporary economy and geopolitics.  Course may be offered in classroom-based or online format.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Colonial and Revolutionary America": {
        "ID": "HIST320",
        "UNITS": "4",
        "DESC": "Settlement and evolution of British America, background to the imperial dispute, events leading to the Revolution, Articles of Confederation, Constitution, the national economy, roles of and impact on African-Americans, women, Native Americans and Loyalists.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Civil War America": {
        "ID": "HIST321",
        "UNITS": "4",
        "DESC": "The experiences of nineteenth-century Americans.  Focus on industrialization, antebellum reform, slavery, the Civil War battlefield and homefront, Reconstruction, and the creation of a New South.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern America": {
        "ID": "HNRS323",
        "UNITS": "4",
        "DESC": "American history since 1900.  Focus on domestic and foreign policy interactions, struggle of disenfranchised groups for social and political equality, and changes in culture and identity.  4 lectures.   Crosslisted as HISTÂ 322/HNRSÂ 323.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "United States Foreign Relations since 1898": {
        "ID": "HIST326",
        "UNITS": "4",
        "DESC": "Topics include imperialism, the world wars, the Cold War, decolonization, and globalization.  Particular attention to ideologies shaping U.S.  policy; ethics and decision-making at multiple levels; and political, economic, social, and cultural consequences of U.S.  activity for societies and individuals around the world.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern Europe, 1789-1914": {
        "ID": "HNRS334",
        "UNITS": "4",
        "DESC": "Europe's 'long nineteenth century' reveals continuity and dramatic changes in politics, social structures and identities, forms of cultural expression, and scientific and technological knowledge.  Topics include the French and Industrial revolutions; liberalism; nationalism; socialism; modernism; imperialism; and World War I.  4 lectures.   Crosslisted as HIST/HNRSÂ 334.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern Europe, 1914-Present": {
        "ID": "HNRS335",
        "UNITS": "4",
        "DESC": "Examination of twentieth-century European history.  Topics include:  First World War, World Economic Crisis, communism, fascism, mass culture, shifting gender roles, Second World War, Cold War, Velvet Revolution, and the European Union.  4 lectures.   Crosslisted as HIST/HNRSÂ 335.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Britain at War: The British, the Americans and the Struggle for Freedom, 1939-1945": {
        "ID": "HIST336",
        "UNITS": "4",
        "DESC": "Historical examination of Great Britain's challenge to its sovereignty and freedom by the regime of Nazi Germany from 1939-1945.  An account of how Britain formed an alliance with the United States, and how that partnership forged a successful campaign that culminated in the survival of Britain and destruction of the Nazi regime.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Colonial Latin America": {
        "ID": "HIST337",
        "UNITS": "4",
        "DESC": "Survey of Latin American history in the colonial period from 1492 to the early nineteenth century.  Special attention to the indigenous cultures, the Iberian civilization, and the evolving relationship between them.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Modern Latin America": {
        "ID": "HIST338",
        "UNITS": "4",
        "DESC": "Social, economic and political history of Latin America from the 19th century to the present.  Historical development of economic structures and political and cultural institutions in the region, including Central America, the Hispanic Caribbean, and South America.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "The Scientific Revolution, c. 1500-1800": {
        "ID": "HNRS350",
        "UNITS": "4",
        "DESC": "History of the intellectual, social, and cultural changes in the early modern period known as the 'Scientific Revolution.' Main topics include the Copernican Revolution, mechanical philosophy, natural history, and the social and material practices of early modern science.  4 lectures.   Crosslisted as HIST/HNRSÂ 350.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Physics II": {
        "ID": "PHYS142",
        "UNITS": "4",
        "DESC": "Oscillations, waves in elastic media, sound waves.  Temperature, heat and the first law of thermodynamics.  Kinetic theory of matter, second law of thermodynamics.  Geometrical and physical optics.  3 lectures, 1 laboratory.  Crosslisted as HNRSÂ 132/PHYSÂ 142.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).  Formerly PHYS 132.\n"
    },
    "General Physics I": {
        "ID": "PHYS141",
        "UNITS": "4",
        "DESC": "Fundamental principles of mechanics.  Vectors, particle kinematics.  Equilibrium of a rigid body.  Work and energy, linear momentum, rotational kinematics and dynamics.  Primarily for engineering and science students.  Course may be offered in classroom-based or online format.  4 lectures.  Crosslisted as HNRSÂ 134/PHYSÂ 141.  Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Calculus I": {
        "ID": "MATH141",
        "UNITS": "4",
        "DESC": "Limits, continuity, differentiation.  Introduction to integration.  4 lectures.  Crosslisted as HNRS/MATHÂ 141.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Calculus II": {
        "ID": "MATH142",
        "UNITS": "4",
        "DESC": "Techniques of integration, applications to physics, transcendental functions.  4 lectures.  Crosslisted as HNRS/MATHÂ 142.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Calculus III": {
        "ID": "MATH143",
        "UNITS": "4",
        "DESC": "Infinite sequences and series, vector algebra, parametric curves.  4 lectures.  Crosslisted as HNRS/MATHÂ 143.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Creating Sustainable Communities I": {
        "ID": "HNRS161",
        "UNITS": "2",
        "DESC": "Environmental, historical, and social dimensions of sustainability. Elements of sustainable communities in a local and global context. Resilience and systems thinking. Introduction to research skills. Developing community within Honors. Includes a service learning component. Upon completion of HNRSÂ 161 and HNRSÂ 162, a student will receive 4 units of GE credit for Area D2 (GE Area D3 for students on the 2019-20 or earlier catalogs). Field trip required. 1 lecture, 1 activity.\n"
    },
    "Creating Sustainable Communities II": {
        "ID": "HNRS162",
        "UNITS": "2",
        "DESC": "Continuation of HNRSÂ 161.  Environmental, historical, and social dimensions of sustainability.  Institutional views of sustainability.  Environmental justice.  Appropriate technology.  Developing community within Honors.  Includes a service learning component.  Upon completion of HNRSÂ 161 and HNRSÂ 162, a student will receive 4 units of GE credit for Area D2 (GE Area D3 for students on the 2019-20 or earlier catalogs).  Field trip required.  1 lecture, 1 activity.\n"
    },
    "Sustainability and Communities": {
        "ID": "HNRS164",
        "UNITS": "4",
        "DESC": "Environmental, historical, and social dimensions of sustainability. Elements of sustainable communities in a local and global context. Resilience and systems thinking. Developing community at Cal Poly. Includes a service learning component. Not open to students with credit in HNRSÂ 161 and HNRSÂ 162. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Gender and Sexuality in US Society and Politics": {
        "ID": "WGQS201",
        "UNITS": "4",
        "DESC": "Survey and exploration, via intersectional frameworks, of the ways that gender and sexuality have impacted, and been impacted by, US society and politics, from the formation of the US as a settler colonial nation-state into the present day. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Crosslisted as HNRSÂ 204/WGS 201. Fulfills GE Area D1 and USCP.\n"
    },
    "Gender and Sexuality in Visual and Popular Culture": {
        "ID": "WGQS210",
        "UNITS": "4",
        "DESC": "Survey and exploration of key developments in visual and popular culture, considered through the lenses of intersectional approaches to gender and sexuality, and examined across multiple mediums and practices including: visual art, film, television, performance, mass media and material culture. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Crosslisted as HNRS/WGQSÂ 210. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs). Formerly WGS 210.\n"
    },
    "Philosophical Classics: Knowledge and Reality": {
        "ID": "PHIL230",
        "UNITS": "4",
        "DESC": "Critical examination of primary philosophical works with focus on the nature of reality and the sources and limits of human knowledge.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as HNRS/PHILÂ 230.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Philosophical Classics: Ethics and Political Philosophy": {
        "ID": "PHIL231",
        "UNITS": "4",
        "DESC": "Critical examination of primary philosophical works, with focus on the identification and evaluation of the central ethical, social and political themes and arguments presented in them.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as HNRS/PHILÂ 231.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Values and Technology": {
        "ID": "ISLA303",
        "UNITS": "4",
        "DESC": "Humanistic investigation into the theoretical and practical applications of technology with specific reference to the social effects of technological change.  Course may be offered in classroomÂ¿based or online format.  For all majors.  Non-technical.  4 lectures.  Crosslisted as HNRSÂ 304/ISLAÂ 303.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Topics and Issues in Values, Media and Culture": {
        "ID": "ISLA320",
        "UNITS": "4",
        "DESC": "The interplay of values, media, and culture from an interdisciplinary perspective.  Descriptive subtitles assigned to each course.  The Class Schedule will list topic selected.  4 lectures.  Total credit limited to 8 units with different subtopic; repeatable in same term.  Crosslisted as HNRS/ISLAÂ 320.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Ethics, Science and Technology": {
        "ID": "PHIL323",
        "UNITS": "4",
        "DESC": "Ethical decision-making as applied to issues such as the use of robots, the treatment of animals, sustainability, scientific fraud, feminist analysis of science and technology, as well as questions about whether technology is just a value-neutral tool or, rather, embodies certain values.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as HNRSÂ 325/PHILÂ 323.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Social Ethics": {
        "ID": "PHIL335",
        "UNITS": "4",
        "DESC": "Examination of contemporary moral problems, solutions to these problems, and the arguments for these solutions, with emphasis on two or more of the following sample problem areas:  abortion, suicide and euthanasia, capital punishment, family ethics, race relations, social justice, war, women's issues.  4 lectures.  Crosslisted as PHILÂ 335/HNRSÂ 336.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Critical Issues in American Politics": {
        "ID": "POLS338",
        "UNITS": "4",
        "DESC": "Examination of significant social, legal, economic and political issues that face the country and how the basic institutions of government-national, state, local-are responding to them; assessment of policies to correct these problems.  4 lectures.   Crosslisted as HNRS/POLSÂ 338.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Sexuality Studies": {
        "ID": "WGQS340",
        "UNITS": "4",
        "DESC": "Sexuality in a cultural and historical context.  Changing definitions of human subjectivity.  The cultural and social regimes that control and create sexuality (including the 'invention' of homo/heterosexuality and the social, legal and political systems that define sexual ab/normality).  Contemporary issues of sexual orientation and topics of sexuality in relation to gender and race.  Course may be offered in classroom-based, online, or hybrid format.  4 seminars.  Crosslisted as WGQS/HNRSÂ 340.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).  Formerly WGS 340.\n"
    },
    "Appropriate Technology for the World's People: Development": {
        "ID": "UNIV391",
        "UNITS": "4",
        "DESC": "A broad overview of international development and appropriate design for sustainability.  Besides traditional classroom work, students work in teams to address problems with technical solutions.  Collaboration with mentors from the university, private sector, and nonprofits serves to provide diverse background and project mentorship.  4 lectures.  Crosslisted as HNRS/PSC/UNIVÂ 391.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Appropriate Technology for the World's People: Design": {
        "ID": "UNIV392",
        "UNITS": "4",
        "DESC": "Addresses the needs of international impoverished communities with technological solutions, which are inexpensive, ecologically sustainable, and socially appropriate.  Group study of target communities, and design and construction of an appropriate technology prototype.  Not open to students with credit in PSC/UNIV/HNRSÂ 492.  3 lectures, 1 laboratory.  Crosslisted as HNRS/PSC/UNIVÂ 392.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Human Factors and Technology": {
        "ID": "IME320",
        "UNITS": "4",
        "DESC": "Analysis of cognitive, sensory and physical limitations and capabilities of operators and users of technology, in working and living environments.  Analysis of pertinent databases for a proactive approach to designing user-centered products, systems and work environment.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Packaging Fundamentals": {
        "ID": "ITP330",
        "UNITS": "4",
        "DESC": "Overview of packaging functions, materials and development.  Discuss value addition to product-package systems via various packaging materials, processes, design and protective packaging for global distribution.  Illustrates the impact of packaging on environment.  Course may be offered in classroom-based, online, or hybrid format.  3 lectures, 1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Packaging Polymers and Processing": {
        "ID": "ITP341",
        "UNITS": "4",
        "DESC": "Physical and chemical properties of plastic materials and processing techniques.  Evaluation of current materials and technologies to reduce waste and to improve reuse and recycling.  Applied laboratory using common industry processes emphasizes relationships among processing, structure, properties, and consumer response.  Course may be offered in classroom-based, or hybrid format.  3 lectures, 1 laboratory.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Topics in Public Engagements with STEM": {
        "ID": "ISLA305",
        "UNITS": "4",
        "DESC": "Exploration of contemporary issues in science, technology, engineering, and mathematics (STEM), with an emphasis on public engagements with STEM research and teaching cultures.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "London: From Roman Colony to World Capital": {
        "ID": "ISLA316",
        "UNITS": "4",
        "DESC": "Selective examination of the historical and cultural legacy of London within the development of Western civilization as well as its influence on the submission and eventual emergence of the non-Western world in the twentieth century.  An analytical and interpretive study of how London shaped the social, economic, political and legal institutions of Western society.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Feminist Studies of Popular Culture and Whiteness": {
        "ID": "WGQS335",
        "UNITS": "4",
        "DESC": "Feminist approaches to the analysis of representations of whiteness in contemporary media, and considerations of the U.S.  cultural values these images illuminate.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as ISLA/WGQSÂ 335.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).  Formerly WGS 335.\n"
    },
    "Advanced Project-Based Learning in Science, Technology & Society": {
        "ID": "ISLA456",
        "UNITS": "4",
        "DESC": "Develop, maintain and lead teams in a project investigating complex multi-disciplinary issues in science, technology and society.  Integrate knowledge across the minors.  2 lectures, 2 activities.\n"
    },
    "Elementary Italian I Study Abroad": {
        "ID": "ITAL141",
        "UNITS": "4",
        "DESC": "Beginning Italian.  Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in ITALÂ 101.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Italian II Study Abroad": {
        "ID": "ITAL142",
        "UNITS": "4",
        "DESC": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in ITALÂ 102.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Italian III Study Abroad": {
        "ID": "ITAL143",
        "UNITS": "4",
        "DESC": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to student with credit in ITALÂ 103.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Italian I Study Abroad": {
        "ID": "ITAL241",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Italian.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in ITALÂ 201.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Media, Self and Society": {
        "ID": "JOUR228",
        "UNITS": "4",
        "DESC": "Overview of the interaction among mass media, social institutions and individuals. Theoretical perspectives from mass communication and psychology. The power and influence of media messages and practices. How individuals and groups develop an understanding of their place within a highly mediated world. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introductory Principles of Exercise Science and Sport": {
        "ID": "KINE240",
        "UNITS": "4",
        "DESC": "Introduction to scientific bases of exercise and sport including concepts associated with health-related components of fitness.  3 lectures, 1 laboratory.\n"
    },
    "Adapted Physical Activity": {
        "ID": "KINE307",
        "UNITS": "4",
        "DESC": "Major categories of disabling conditions with implications for the development of physical activity programs for specific disabilities.  3 lectures, 1 laboratory.  Formerly KINE 407.\n"
    },
    "Sport and Gender": {
        "ID": "KINE323",
        "UNITS": "4",
        "DESC": "Intersections between sport and gender in American society.  Identification and discussion of the historical, sociological and psychological issues that affect the sport experiences of males and females, especially as they relate to class, race/ethnicity, sexuality, and political movements.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Sports, Media and American Popular Culture": {
        "ID": "KINE324",
        "UNITS": "4",
        "DESC": "Issues of class, race/ethnicity, gender, various forms of deviance, and other aspects of social life.  Exploration of sociological manifestations and implications of how the aforementioned social issues are embedded in mediated forms of sports.  3 lectures, 1 activity.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Psychological Aspects of Injury in Sport and Physical Activity": {
        "ID": "KINE382",
        "UNITS": "4",
        "DESC": "Psychosocial antecedents to injury in sport/exercise, factors in psychological experience and treatment of the injured individual.  Psychological theories and applied considerations related to injury and rehabilitation.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of Landscape Architecture: Ancient Civilizations through Colonial America": {
        "ID": "LA211",
        "UNITS": "4",
        "DESC": "Philosophies and ethics of important personalities and events of landscape architecture explored from recorded time through colonial America. Design theories support projects and individuals of their practice combined with influential events in industry, the arts and sciences, politics, and society. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of Modern and Contemporary Landscape Architecture": {
        "ID": "LA212",
        "UNITS": "4",
        "DESC": "Philosophies and ethics of important personalities explored through the twentieth and twenty-first centuries of landscape architecture. Design theories supporting these individuals' projects and the nature of their practice combined with the influential events in industry, the arts and sciences, politics, and society. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Landscape Ecology: Concepts, Issues, and Interrelationships": {
        "ID": "LA220",
        "UNITS": "4",
        "DESC": "Concepts, theories and techniques related to landscape analysis, ecology, planning and design with an emphasis on landscape assessment, sustainability, land health, environmental protection and restoration, and natural resource management.  4 lectures.  Fulfills GE Area B2.\n"
    },
    "The World of Spatial Data and Geographic Information Technology": {
        "ID": "NR317",
        "UNITS": "4",
        "DESC": "Foundation for understanding the world through geographic information as well as the tools available to utilize spatial data.  Experience with Geographic Information Systems (GIS) and related technology.  Not open to students with credit in GEOGÂ 218 or LA/NRÂ 218.  3 lectures, 1 activity.  Crosslisted as LA/NRÂ 317.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Identity and Equity in American Schools": {
        "ID": "LS350",
        "UNITS": "4",
        "DESC": "Interdisciplinary examination of school, family, and community relationships, at the school and classroom level.  Role of teachers' and students' intersectional identities in school achievement, disciplinary, and life-course outcomes.  The school-to-prison-to-deportation pipeline.  Educational equity and related issues.  Course may be offered in classroom-based or online format.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Survey of Marine Biology": {
        "ID": "MSCI111",
        "UNITS": "4",
        "DESC": "Marine organisms and their adaptations to the ocean. Focus on select marine ecosystems including coastal ecosystems. Interaction between humans and the sea. Topics include effects of ocean acidification and pollution, climate change, and loss of marine biodiversity. Not open for major credit in Biological Sciences, Marine Sciences, or Microbiology. 4 lectures. Fulfills GE Area B2.\n"
    },
    "Technologies for Ocean Discovery": {
        "ID": "MSCI330",
        "UNITS": "4",
        "DESC": "Survey of ocean sensor systems and emerging technologies that provide new understanding of the ocean.  Current issues in marine science.  Social context, societal implications of discoveries in ocean sciences.  Field trip required.  Not open for major credit in Biological Sciences, Marine Sciences or Microbiology.  Not open to students with credit in MSCIÂ 403.  3 lectures, 1 activity.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Living in a Material World": {
        "ID": "MATE359",
        "UNITS": "4",
        "DESC": "Evolution of materials (ceramics, metals, polymers, composites, semiconductors) in the context of history.  Traces the link between historical and technological developments enabled by materials from the Stone Age to the Electronic Age.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Nature of Modern Math": {
        "ID": "MATH112",
        "UNITS": "4",
        "DESC": "Topics from contemporary mathematics, their development, applications, and role in society.  Some typical topics to be chosen by the instructor:  graph theory, critical path analysis, statistical inference, coding, game theory, and symmetry.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE Area.\n"
    },
    "Stretch Precalculus Algebra I": {
        "ID": "MATH115",
        "UNITS": "3",
        "DESC": "First course in precalculus college algebra without trigonometry, with built-in review of basic algebra skills necessary to be successful in precalculus.  Factoring, exponents, and radicals.  Real and complex numbers.  Modeling with equations and inequalities.  Linear, quadratic, and polynomial functions and their graphs.  MATHÂ 115 or MATHÂ 116, and MATHÂ 117 are equivalent to MATHÂ 118, but are taught at a slower pace.  Upon completion of MATHÂ 115 or MATHÂ 116, and MATHÂ 117, a student will receive 4 units of GE credit for Area B4.  A grade of C- or better is required in one course in GE Area B4 to fulfill General Education requirements.  Not open to students with credit in MATHÂ 116, MATHÂ 118, MATHÂ 141, MATHÂ 161, or MATHÂ 221.  3 lectures.\n"
    },
    "Precalculus Algebra I": {
        "ID": "MATH116",
        "UNITS": "3",
        "DESC": "First course in precalculus college algebra without trigonometry.  Factoring, exponents, and radicals.  Real and complex numbers.  Modeling with equations and inequalities.  Linear, quadratic, and polynomial functions and their graphs.  MATHÂ 115 or MATHÂ 116, and MATHÂ 117 are equivalent to MATHÂ 118, but are taught at a slower pace.  Upon completion of MATHÂ 115 or MATHÂ 116, and MATHÂ 117, a student will receive 4 units of GE credit for Area B4.  A grade of C- or better is required in one course in GE Area B4 to fulfill General Education requirements.  Not open to students with credit in MATHÂ 115, MATHÂ 118, MATHÂ 141, MATHÂ 161, or MATHÂ 221.  Credit will be granted in only one of the following courses:  MATHÂ 115, MATHÂ 116, or MATHÂ 118.  3 lectures.\n"
    },
    "Precalculus Algebra II": {
        "ID": "MATH117",
        "UNITS": "3",
        "DESC": "Second course in precalculus college algebra without trigonometry.  Rational, exponential, and logarithmic functions.  Matrices, determinants, and systems of linear equations.  MATHÂ 115 or MATHÂ 116, and MATHÂ 117 are equivalent to MATHÂ 118, but are taught at a slower pace.  Upon completion of MATHÂ 115 or MATHÂ 116, and MATHÂ 117, a student will receive 4 units of GE credit for Area B4.  A grade of C- or better is required in one course in GE Area B4 to fulfill General Education requirements.  Not open to students with credit in MATHÂ 118.  3 lectures.\n"
    },
    "Precalculus Algebra": {
        "ID": "MATH118",
        "UNITS": "4",
        "DESC": "Precalculus algebra without trigonometry.  Factoring, exponents, and radicals.  Real and complex numbers.  Modeling with equations and inequalities.  Rational, exponential, and logarithmic functions.  Matrices, determinants, and systems of linear equations.  MATHÂ 118 is equivalent to MATHÂ 115 or MATHÂ 116, and MATHÂ 117.  Not open to students with credit in MATHÂ 117, MATHÂ 141, MATHÂ 161, or MATHÂ 221.  Credit will be granted in only one of the following courses:  MATHÂ 115, MATHÂ 116, or MATHÂ 118.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Precalculus Trigonometry": {
        "ID": "MATH119",
        "UNITS": "4",
        "DESC": "Rectangular and polar coordinates.  Trigonometric functions, fundamental identities.  Inverse trigonometric functions and relations.  Complex numbers, conic sections, and analytic geometry.  Not open to students with credit in MATHÂ 141, MATHÂ 161, or MATHÂ 221.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Calculus for the Life Sciences I": {
        "ID": "MATH161",
        "UNITS": "4",
        "DESC": "Differential calculus with applications in the biological sciences.  Review of exponential, logarithmic, and trigonometric functions.  Limits, continuity, differentiation.  Examples, exercises, and applications to emphasize problems in the biological sciences.  Not open to students with credit in MATHÂ 141.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Calculus for the Life Sciences II": {
        "ID": "MATH162",
        "UNITS": "4",
        "DESC": "Integral calculus with applications in the biological sciences.  Techniques of integration.  Matrices, partial derivatives, and introduction to differential equations and mathematical modeling.  Examples, exercises, and applications to emphasize problems in the biological sciences.  Not open to students with credit in MATHÂ 142.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Calculus for Architecture and Construction Management": {
        "ID": "MATH182",
        "UNITS": "4",
        "DESC": "Integral calculus with applications to architecture and construction management.  The algebra of vectors.  Polar, cylindrical, and spherical coordinate systems.  Not open to students with credit in MATHÂ 142.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Calculus for Business and Economics": {
        "ID": "MATH221",
        "UNITS": "4",
        "DESC": "Limits, continuity, differentiation.  Exponential and logarithmic functions.  Introduction to integration.  Examples, exercises and applications to emphasize problems in business and economics.  Not open to students with credit in MATHÂ 141.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Mathematics for Elementary Teaching I": {
        "ID": "MATH227",
        "UNITS": "4",
        "DESC": "Introduction to problem solving, set theory, number systems, arithmetic operations, models, and number theory.  This class is designed for Liberal Studies majors.  Other students will be admitted by consent of instructor.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Vector Analysis": {
        "ID": "MATH304",
        "UNITS": "4",
        "DESC": "Differential and integral calculus of vector-valued functions.  Green's Theorem, Stokes' Theorem, and the Divergence Theorem.  Applications and generalizations.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Combinatorial Math": {
        "ID": "MATH334",
        "UNITS": "4",
        "DESC": "Methods of enumerative combinatorics:  sum, product, and division rules, bijective and recursive techniques, inclusion and exclusion, and generating functions.  Advanced topics to be selected from the theory of partitions, finite difference calculus, Polya theory, designs, and codes.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Linear Analysis II": {
        "ID": "MATH344",
        "UNITS": "4",
        "DESC": "Linear methods applied to the solution of differential equations.  Laplace transforms.  Series solutions to ordinary differential equations.  Orthogonality in n-space, Gram-Schmidt orthogonalization and least squares methods.  Orthogonal bases in function spaces, Sturm-Liouville theory.  Fourier series and transforms.  Special functions of applied mathematics.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Engineering Principles in Everyday Life": {
        "ID": "ME313",
        "UNITS": "4",
        "DESC": "Discover engineering principles and concepts such as natural frequencies, entropy, Coriolis acceleration, and Faraday's Law that govern our everyday lives, many aspects of human body, and consumer products.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Microbiology": {
        "ID": "MCRO221",
        "UNITS": "4",
        "DESC": "Microbial classification and identification, cell structure and function, metabolism, microbial systems and evolutionary processes, with applications to industry, agriculture, food production, environment, and health.  Not open to students with credit in MCROÂ 224; not for credit for Biology and Microbiology majors.  3 lectures, 1 laboratory.  Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Microbiology I": {
        "ID": "MCRO224",
        "UNITS": "5",
        "DESC": "Fundamental concepts of prokaryotes, eukaryotic microorganisms and microbiological entities.  Microbial taxonomy, classification, cellular structure and function, metabolism, growth dynamics and control.  Introduction to microbial genetics and molecular techniques.  Microbial interaction with human and society.  Fundamental laboratory techniques in microbiology.  3 lectures, 2 laboratories.  Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Music Theory": {
        "ID": "MU101",
        "UNITS": "4",
        "DESC": "Introduction to materials of music and their use by composers and performers in diverse cultural contexts. Notation of dynamics, pitch, rhythm, scales, key signatures, intervals, and chords. Analysis of musical syntax based on these elements. 3 lectures, 1 activity. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Music Appreciation": {
        "ID": "MU120",
        "UNITS": "4",
        "DESC": "Explores the elements of music with emphasis on Western tradition. Language of music, the role of music in society. Historical context and major composers from the Middle Ages to the present. 3 lectures, 1 activity. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Jazz Styles": {
        "ID": "MU221",
        "UNITS": "4",
        "DESC": "Survey of Jazz as a significant American art form from 1900 to the present; its historical background and development in the United States; key elements, leading performers, and significant compositions in each style. Emphasis on listening skills. 3 lectures, 1 activity. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Popular Music of the USA": {
        "ID": "MU227",
        "UNITS": "4",
        "DESC": "Study of popular music of the USA from the nineteenth century to contemporary times. Emphases include cultural identity, social diversity, musical aesthetics, artistic significance, ethnic relations, gender issues, religious expression, performance practice, technological development, modernization, commodification, and political empowerment. 3 lectures, 1 activity. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Music and Society": {
        "ID": "MU324",
        "UNITS": "4",
        "DESC": "Exploration into the role of music historically and culturally.  Emphasis on deeper understanding and appreciation of the context of music through topics of special interest.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  3 lectures, 1 activity.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Women in Music": {
        "ID": "MU328",
        "UNITS": "4",
        "DESC": "Survey of women's contributions as composers and performers of western art and popular music; historical overview of the experiences and perception of women as musicians.  3 lectures, 1 activity.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Agroecology": {
        "ID": "NR304",
        "UNITS": "4",
        "DESC": "Ecological concepts and principles applied to the design and management of agricultural systems.  Discussion of research in agroecology and assessment of cropping system sustainability.  Laboratory section emphasizes field assessment of ecological structures and functions, experimental design and data interpretation.  3 lectures.  1 laboratory.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Forest Ecology and Silvics": {
        "ID": "NR305",
        "UNITS": "4",
        "DESC": "Examination of major forest types and the processes that determine their development and productivity across the earth (silvics).  Integration of ecosystem ecology, plant physiology, and soil science to develop understanding of forest response to disturbance.  Field trip required.  3 lectures, 1 laboratory.\n"
    },
    "Natural Resource Ecology and Habitat Management": {
        "ID": "NR306",
        "UNITS": "4",
        "DESC": "Resource ecology and management implications in the major ecosystems of North America.  Importance of maintaining the natural dynamics of energy flow and nutrient cycles at the community and ecosystem level to sustain uses and values.  Humanity's role as a principal factor of change of the resources in natural systems.  3 lectures, 1 laboratory.\n"
    },
    "Fire Ecology": {
        "ID": "NR307",
        "UNITS": "3",
        "DESC": "Effects of wildland fires on shrub, woodland, and forest environments to include fuels, plants, soil, water, wildlife, and air.  Emphasis on western U.S.  forest and shrub ecosystems.  2 lectures, 1 laboratory.\n"
    },
    "Global Climate Change": {
        "ID": "NR310",
        "UNITS": "4",
        "DESC": "Examination and assessment of the physical and biological mechanisms that maintain current global climate regimes and the broad natural resource, political, and social conflict associated with a changing climate system.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Technology of Wildland Fire Management": {
        "ID": "NR312",
        "UNITS": "4",
        "DESC": "Historic, current and future perspectives of wildland fire in California.  Sustainability and ecosystem health.  The use of models and technology to solve complex land management problems.  Assumptions and limitations of fire behavior and suppression models.  3 lectures, 1 activity.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Water Resources Technology and Society": {
        "ID": "NR321",
        "UNITS": "4",
        "DESC": "Study of technologies for sustainable management of water resources.  Focus on monitoring of drinking water supply and quality, groundwater wells, surface water storage and conveyance systems, industrial, and oil/gas water use and management, and stresses due to climate change.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Human Dimensions in Natural Resources Management": {
        "ID": "NR323",
        "UNITS": "4",
        "DESC": "Social, economic, political and ecological conditions and institutions that influence decisions affecting the environment; examination of human-caused environmental impacts and how they in turn influence social institutions.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Social Dimensions of Sustainable Food and Fiber Systems": {
        "ID": "NR324",
        "UNITS": "4",
        "DESC": "Historical, political, socio-economic, and cultural dimensions of sustainable food and fiber systems.  Overview of frameworks used for understanding agro-ecological sustainability with an emphasis on human elements.  Exploration of core sustainability concepts, practices, and goals through case studies.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Environmental Leadership and Community Engagement": {
        "ID": "RPTA328",
        "UNITS": "4",
        "DESC": "Theories and practices of leadership and community engagement for a wide range of environmental issues.  Development of personal leadership skills and methods for effectively working with non-profit organizations, governmental agencies, community groups, and the private sector to advance sustainability principles.  4 lectures.  Crosslisted as NR/RPTAÂ 328.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Logic and Argumentative Writing": {
        "ID": "PHIL126",
        "UNITS": "4",
        "DESC": "Principles of argument analysis, evaluation and construction.  Deductive and inductive reasoning, including analogical arguments, universal and statistical generalizations, and causal inferences.  Principles of organizing and writing argumentative essays.  Moral dimensions of rational discourse.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area A3 with a grade of C- or better.\n"
    },
    "Philosophical Topics": {
        "ID": "PHIL301",
        "UNITS": "4",
        "DESC": "Examination and analysis of philosophical areas, movements, texts, or figures.  Topics may be of historical or contemporary importance.  The Class Schedule will list topic selected.  Total credit limited to 16 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Early Greek Philosophy through Plato": {
        "ID": "PHIL309",
        "UNITS": "4",
        "DESC": "Beginnings of Western philosophy and science in Ancient Greece.  The Presocratics, Socrates, and Plato.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Aristotle and Hellenistic Philosophy": {
        "ID": "PHIL310",
        "UNITS": "4",
        "DESC": "Development of Western philosophy and science in the Hellenistic and Roman periods.  Aristotle, Epicureanism, Stoicism, Skepticism.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Medieval Philosophy": {
        "ID": "PHIL312",
        "UNITS": "4",
        "DESC": "Development of Western philosophy from Augustine to Ockham, including Anselm, Abelard, Roger Bacon, Bonaventure, Aquinas, and Duns Scotus.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Early Modern Rationalism": {
        "ID": "PHIL313",
        "UNITS": "4",
        "DESC": "Development of Western philosophy from the late Renaissance through Leibniz, with special emphasis upon the epistemology and metaphysics of the Continental Rationalists.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Early Modern Empiricism": {
        "ID": "PHIL314",
        "UNITS": "4",
        "DESC": "Development of Western philosophy from the Renaissance through Mill, with special emphasis on British Empiricism.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Kant and 19th Century European Philosophy": {
        "ID": "PHIL315",
        "UNITS": "4",
        "DESC": "Primary issues and concepts found in German philosophy from 1780 to 1900, with emphasis on Kant, Hegel, and Nietzsche.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of Analytic Philosophy": {
        "ID": "PHIL317",
        "UNITS": "4",
        "DESC": "Major developments within 20th century British and American philosophy, with focus chiefly around Analytic philosophy.  Other schools, such as Pragmatism, may be included, as may some philosophers outside of Britain and America whose work was influential in those countries.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Phenomenology": {
        "ID": "PHIL318",
        "UNITS": "4",
        "DESC": "Methods and uses of phenomenological analysis through study of 20th century philosophers and contemporary applications.  Topics include phenomenological method, perception, meaning, and the role of experience in philosophical inquiry.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Existentialism": {
        "ID": "PHIL319",
        "UNITS": "4",
        "DESC": "Major existentialist philosophers of the 19th and 20th century such as Kierkegaard, Nietzsche, Heidegger, Sartre, de Beauvoir, Merleau-Ponty, and Marcel.  Existentialist themes in historical or contemporary context.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Philosophy of Science": {
        "ID": "PHIL321",
        "UNITS": "4",
        "DESC": "The rational foundations of inquiry and explanation in the physical, biological and social sciences.  Justification of scientific claims, the difference between science and pseudoscience, the relationship between science and other fields of investigation.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Philosophy of Technology": {
        "ID": "PHIL322",
        "UNITS": "4",
        "DESC": "Analyses of the philosophical foundations and implications of technology.  Technology and the human condition, technology and philosophical ethics, technology and political philosophy, technology and the metaphysics of human nature, and the relationship between science and technology.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Robot Ethics": {
        "ID": "PHIL327",
        "UNITS": "4",
        "DESC": "Introduction, short history, and overview of robot (meta)ethics, with applied ethics issues to include programming, environment, military uses, sex, legal implications, risk, liability, diversity, sustainability, healthcare, education, religion, and the home.  Finally, future issues of robot rights and personhood.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Technologies and Ethics of Warfare": {
        "ID": "PHIL328",
        "UNITS": "4",
        "DESC": "Ethics of killing in warfare, including requirements of justice in declaring and waging war.  Topics include terrorism, remotely piloted aircraft ('drones'), autonomous weapons ('killer robots'), cyber warfare, nuclear war, city bombing, and humanitarian intervention.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Ethics": {
        "ID": "PHIL331",
        "UNITS": "4",
        "DESC": "Analyses of various traditional and contemporary positions on the difference between right and wrong, if there is one.  Theories of metaethics and normative ethics including the divine command theory, relativism, intuitionism, noncognitivism, virtue ethics, egoism, utilitarianism and duty-based ethics.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "History of Ethics": {
        "ID": "PHIL332",
        "UNITS": "4",
        "DESC": "The history of moral thought from Homer and the Pre-Socratics to the 20th century, and focus on theories of moral goodness and rightness of action.  Related issues and areas of thought, e.g.  metaphysics, theology, science, politics, psychology freedom/determinism to be considered, where they shed light on moral thought.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Political Philosophy": {
        "ID": "PHIL333",
        "UNITS": "4",
        "DESC": "Analyses of the philosophical foundations of political ideologies, including theories of political authority, legitimacy, obligation, and rights, and of the proper function of the state, and the relation of these theories to issues in meta-physics, theory of knowledge, and ethics.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Philosophy of Law": {
        "ID": "PHIL334",
        "UNITS": "4",
        "DESC": "Normative and analytic questions about law.  Nature of law and legal systems.  Justification of law.  Moral obligation to obey the law.  Nature and justification of punishment.  Guilt and legal responsibility.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Feminist Ethics, Gender, Sexuality and Society": {
        "ID": "WGQS336",
        "UNITS": "4",
        "DESC": "Critical examination of the relations between gender, sexuality, ethnicity, society and ethics from feminist perspectives, with special attention paid to problems in contemporary applied ethics.  Joint focus on theory and application.  Course may be offered in classroom-based or online format.  4 lectures.  Crosslisted as PHIL/WGQSÂ 336.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.  Formerly WGS 336.\n"
    },
    "Business Ethics": {
        "ID": "PHIL337",
        "UNITS": "4",
        "DESC": "Critical examination of ethical problems that arise in business.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Biomedical Ethics": {
        "ID": "PHIL339",
        "UNITS": "4",
        "DESC": "Critical examination of problems in biomedical ethics, proposed solutions to these problems, and the arguments for such solutions.  Emphasis on two or more of the following sample problem areas:  concepts of health and disease, human experimentation, informed consent, behavior control, genetic intervention, new birth technologies, euthanasia and physician-assisted dying.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Environmental Ethics": {
        "ID": "PHIL340",
        "UNITS": "4",
        "DESC": "Analyses of various positions on the moral status of nonhuman entities and problems such as the treatment of animals, wilderness preservation, population, pollution and global warming.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Professional Ethics": {
        "ID": "PHIL341",
        "UNITS": "4",
        "DESC": "Moral problems as they arise in professions such as law, medicine, engineering, research and education:  deception, paternalism, confidentiality, discrimination and others.  Consideration of various professional codes of ethics.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Philosophy of Religion": {
        "ID": "PHIL342",
        "UNITS": "4",
        "DESC": "Inquiry into the rational and nonrational bases of religious claims.  Arguments for and against the existence of God.  Discussion of miracles, revelation, the definition of God, the problem of evil, the relation of faith and reason, the nature of religious experience, the verification of religious claims.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Power, Alienation, and Political Life": {
        "ID": "PHIL343",
        "UNITS": "4",
        "DESC": "Analysis of social alienation, political resistance, and the interplay between power and individual life in 20th- and 21st-century Continental philosophy.  Emphasis on issues such as structural injustice, cultural membership and exclusion, work, media, and the political impact of technology.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Aesthetics": {
        "ID": "PHIL350",
        "UNITS": "4",
        "DESC": "Critical examination of philosophical views of art from both a historical and contemporary perspective.  Treatment of theories from Plato and Aristotle through those of the twentieth century.  Discussion of the problems raised by modern art.  The relation between aesthetic values and metaphysics, epistemology, ethics and politics.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Philosophy of Literature": {
        "ID": "PHIL351",
        "UNITS": "4",
        "DESC": "Analysis of philosophical issues related to literature such as interpretation, authorial intention, linguistic expression, ethical responsibilities of writers and readers, and use of literary styles by philosophers.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Indian Philosophy": {
        "ID": "PHIL361",
        "UNITS": "4",
        "DESC": "Philosophies developed in South Asia including the metaphysical, epistemological, and logical presuppositions of the six Hindu schools, the Buddhist and Jain schools, and select theistic traditions.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Chinese and East Asian Philosophy": {
        "ID": "PHIL362",
        "UNITS": "4",
        "DESC": "Philosophies developed in China, Japan and East Asia, including Buddhism, Confucian moral philosophy, Daoist metaphysics and social ecology.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Postmodernism": {
        "ID": "PHIL369",
        "UNITS": "4",
        "DESC": "Primary issues and developments in European philosophy in the second half of the 20th century.  Examination of the influence of postmodern philosophy in areas such as art, literature, architecture, culture studies, philosophy of language, and philosophy of religion.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Matter and Energy": {
        "ID": "PSC101",
        "UNITS": "4",
        "DESC": "Introduction to the basic principles of physical science, including observation, description, modeling, and the application of physical phenomena. Emphasis on interactions as described by energy, forces, and fields for mechanical, thermal, electric, and magnetic systems. 3 lectures, 1 laboratory. Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Physical Oceanography": {
        "ID": "PSC201",
        "UNITS": "4",
        "DESC": "Introduction to the motions of the ocean. Physical environment and sea floor features; seawater properties; atmosphere and ocean interactions; ocean currents and circulation; waves and tides; the El Nino cycle; coastal ocean processes; climate change and ocean stressors; ocean resources and marine life. 4 lectures. Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Nuclear Energy and Weapons in the Modern World": {
        "ID": "PSC307",
        "UNITS": "4",
        "DESC": "Technology and basic science of fission/fusion weapons, uranium/plutonium, nuclear reactors, offensive/defensive missile systems, command/control, verification, weapon effects, nuclear testing.  Historical context of Cold War and proliferation, recent events, global norms, arms control treaties.  3 lectures, 1 seminar.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Energy, Society and the Environment": {
        "ID": "PSC320",
        "UNITS": "4",
        "DESC": "Science and technology of current and future energy sources along with associated environmental problems and societal response.  Energy production, consumption, efficient usage, fossil fuels, nuclear, solar, other renewables.  Risks, benefits, planning, economics.  3 lectures, 1 activity.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Introductory Physics": {
        "ID": "PHYS104",
        "UNITS": "4",
        "DESC": "Elementary introduction to mechanics, gases, liquids and solids, heat, vibrations and waves, light, electricity and magnetism.  Intended to provide non-science students with an understanding of basic physical concepts.  Not open to students who have credit in a college physics course.  4 lectures.  Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Contemporary Physics for Nonscientists": {
        "ID": "PHYS111",
        "UNITS": "4",
        "DESC": "Qualitative exploration of the key concepts of quantum mechanics and Einstein's special and general theories of relativity. Particle-wave duality, Heisenberg's uncertainty principle, Schrodinger's cat, warped spacetime, black holes. 4 lectures. Not open to students with credit in PHYSÂ 211. Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "College Physics I": {
        "ID": "PHYS121",
        "UNITS": "4",
        "DESC": "Introductory course in mechanics emphasizing motion, force, and energy.  Not open to students having a grade of C- or better in PHYSÂ 141.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Area B1 (GE Area B3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "College Physics II": {
        "ID": "PHYS122",
        "UNITS": "4",
        "DESC": "Continuation of PHYSÂ 121.  Topics include properties of materials, fluids, waves and vibrations, sound, heat, light and optics.  Not open for credit to students having a grade of C- or better in PHYS 132.  3 lectures, 1 laboratory.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Physics III": {
        "ID": "PHYS143",
        "UNITS": "4",
        "DESC": "Charge and matter, electric field, electric potential, dielectrics, capacitance, current and resistance, electromotive force and circuits, magnetic fields, magnetic field of a moving charge, induced emf.  3 lectures, 1 laboratory.  Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).  Formerly PHYS 133.\n"
    },
    "Classical Mechanics I": {
        "ID": "PHYS305",
        "UNITS": "4",
        "DESC": "Laws of motion, kinematics and dynamics of a particle.  Oscillations.  Work and energy.  Linear and angular momentum.  Lagrange's and Hamilton's equations and the calculus of variations.  Newton's Law of gravity, Kepler's laws of orbital motion, and central force problems.  Use of numerical methods for solving problems.  Not open to students with credit in PHYS 302.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "People, Pests and Plagues": {
        "ID": "PLSC110",
        "UNITS": "4",
        "DESC": "Introduction to the science of entomology, including insect identification, biology, ecology and evolution. Insects as beneficials, disease vectors and crop pests, and their interactions with humans, including roles in human culture and history. Not open for credit to Agricultural and Environmental Plant Sciences, Plant Sciences, or Wine and Viticulture majors (Viticulture concentration). 3 lectures, 1 activity. Fulfills GE Areas B2 and B3 (GE Areas B2 and B4 for students on the 2019-20 or earlier catalogs). Formerly AEPS 110.\n"
    },
    "Plants, Biotechnology, and the Media": {
        "ID": "PLSC329",
        "UNITS": "4",
        "DESC": "Agriculture as applied biology and its impact on civilization.  Application of technology to increase the efficiency of food production.  Genetics and biotechnology; culminating in an assessment of genetically engineered foods, the myths, the controversy, the science.  3 lectures, 1 activity.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).  Formerly AEPS 329.\n"
    },
    "American and California Government": {
        "ID": "POLS112",
        "UNITS": "4",
        "DESC": "Study of U.S. and California government institutions, politics, issues and political behavior. Constitutional, historical, social, economic, and cultural perspectives. Relationships to social, economic, and political inequality, and unequal treatment of historically marginalized groups and efforts to address unequal treatment. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area D1.\n"
    },
    "Global Political Issues": {
        "ID": "POLS325",
        "UNITS": "4",
        "DESC": "Concepts and theories in international relations and contemporary global issues.  Application of principles of international relations to political issues and subjects which affect our lives.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "U.S. and China in the Contemporary World": {
        "ID": "POLS337",
        "UNITS": "4",
        "DESC": "Investigation of China's political history with close attention to past and present U.S.-China relations.  Topics include the conflict over Taiwan, territorial disputes in the South China Sea, and ongoing economic cooperation and competition, concerning trade and debt.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Authoritarian and Democratic Rule": {
        "ID": "POLS339",
        "UNITS": "4",
        "DESC": "A comparative examination of governing institutions used throughout the world.  Emphasis on the diversity of governmental designs found within both authoritarian and democratic regimes.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Early American Political Thought": {
        "ID": "POLS348",
        "UNITS": "4",
        "DESC": "The central political ideas of America's leading thinkers from the arrival of the Mayflower to the Civil War.  Selections may include readings of American political ideas from Winthrop, Paine, Publius, Hamilton, de Tocqueville, Douglass, Calhoun, Thoreau, and Lincoln, among others.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Contemporary American Political Thought": {
        "ID": "POLS349",
        "UNITS": "4",
        "DESC": "The central political ideas of America's leading thinkers from the Civil War to the present.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "General Psychology": {
        "ID": "PSY202",
        "UNITS": "4",
        "DESC": "Introduction to the psychological study of human beings. Applications and research in areas such as psychobiology, perception, learning, motivation, consciousness, memory and cognition, personality, emotion, development, psychological assessment, social behavior, psychopathology and psychotherapy. A student may enroll for credit in either PSYÂ 201 or PSYÂ 202, but not both. 3 lectures, 1 discussion. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs).\n"
    },
    "Intergroup Dialogues": {
        "ID": "PSY304",
        "UNITS": "4",
        "DESC": "Weekly meetings of students from two distinct self-defined identity groups, with trained peer facilitators, in which readings, experiential activities, informed dialogue, and reflective writing are integrated as a means of encouraging self and group awareness and exploring ways to promote just community across difference.  Supplemented by weekly lecture/discussions.  2 lectures, 2 discussions.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Environmental Psychology": {
        "ID": "PSY311",
        "UNITS": "4",
        "DESC": "Interrelationship between behavior and the built and natural environments.  Evaluating and understanding environments, environmental stress, and the human aspects of environmental problems.  Course may be offered in classroom-based or online format.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Psychology of Aging": {
        "ID": "PSY318",
        "UNITS": "4",
        "DESC": "Psychological and physiological aging in the context of the culture.  Theories and research relating to the issues of stability and both positive and negative changes in perception, learning, memory, intelligence, personality, identity, motivation, sexuality, family relationships, career.  Disorders, institutionalization, death and bereavement.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Biopsychology": {
        "ID": "PSY340",
        "UNITS": "4",
        "DESC": "Relationship between physiological and behavioral processes such as learning and memory, language, sleep, and abnormal behavior.  Information processing, biochemistry, and structural organization at the cellular and nervous system levels.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Behavioral Genetics": {
        "ID": "PSY344",
        "UNITS": "4",
        "DESC": "Examine the relative influence of genetic and environmental factors on human behavior.  Emphasis on the foundation and application of behavioral genetics to the field of psychology.  Topics include heritability, gene-environment interplay, ethics, and emerging technologies.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Conflict Resolution: Violent and Nonviolent": {
        "ID": "PSY352",
        "UNITS": "4",
        "DESC": "Psychological, situational, political, and cultural determinants of violence and nonviolence in interpersonal, intergroup, and international conflict.  Self-assessment of conflict resolution attitudes, competencies, and behaviors.  Negotiation, mediation, and other approaches to conflict management.  Educational and structural approaches to violence prevention.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Sociocultural Dimensions of Work and Leisure": {
        "ID": "RPTA201",
        "UNITS": "4",
        "DESC": "History and theoretical framework associated with the interplay between work and leisure in the United States; global perspective examining sociocultural differences and marginalization of groups; issues impacting work-life balance including technology, demography, geography, corporate culture, and career fields. Course may be offered in an online or hybrid format. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Leadership and Diverse Groups": {
        "ID": "RPTA255",
        "UNITS": "4",
        "DESC": "Development and application of leadership skills in recreation activity settings. Emphasis on leadership techniques for working with groups consisting of people from diverse populations, such as people with disabilities or special needs, diverse social and cultural groups, and diversity of ages. Course may be offered in classroom-based, online, or hybrid format. 3 lectures, 1 activity. Fulfills GE Area E (GE Area D4 for students on the 2017-19 or earlier catalogs).\n"
    },
    "Religion, Dialogue, and Society": {
        "ID": "RELS201",
        "UNITS": "4",
        "DESC": "Examine how interactions between religious traditions shape society at various levels. Case studies drawn from eastern and western religious traditions during the ancient and modern periods. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Religions of Asia": {
        "ID": "RELS301",
        "UNITS": "4",
        "DESC": "Comparative study of the religions of Asia, particularly Hinduism, Buddhism, and the religions of China.  Topics include historical continuities/discontinuities, worldviews, sacred texts, practices, responses to modernity, the place of women across the traditions.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Abrahamic Religions: Judaism, Christianity, and Islam": {
        "ID": "RELS302",
        "UNITS": "4",
        "DESC": "An introduction to the global religions of Judaism, Christianity, and Islam, with a focus on their shared origin in the Patriarch Abraham.  Topics include for each religion:  the origins, worldview, scripture, practices, and relationship to modernity.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Judaism": {
        "ID": "RELS304",
        "UNITS": "4",
        "DESC": "Origins, beliefs and practices of Judaism and central themes in the Hebrew Bible.  The development of Judaism in the post-biblical and Talmudic period.  Jewish philosophy, life, rituals and customs.  The emergence of modern Judaism, Zionism and post-Holocaust philosophy.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Hinduism": {
        "ID": "RELS306",
        "UNITS": "4",
        "DESC": "Origins, beliefs and practices of Hinduism from the Veda and the Upanishads through the teachings of the Bhagavad Gita and the Puranas.  Modern Hindu institutions, saints and sages, and social philosophy contrasted with the ancient.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Buddhism": {
        "ID": "RELS307",
        "UNITS": "4",
        "DESC": "Buddhist origins, viewpoints and practices will be seen in their development in India, Tibet, China, Japan, South Asia and America.  The life of Buddha, Gautama, the rise of Theravada, Mahayana and Tantra.  Encounters with Shinto and Confucianism.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Christianity": {
        "ID": "RELS310",
        "UNITS": "4",
        "DESC": "The development of the Christian religion from the story of Jesus, the New Testament, Church formation, the role of St.  Paul, dissenting ideas, Protestant and Catholic views, and contemporary issues of conscience, such as the Social Gospel and liberation theologies.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Islam": {
        "ID": "RELS311",
        "UNITS": "4",
        "DESC": "The development of Islamic civilization from the inspiration of the Qur'an and the Prophet Muhammad and the Sunni-Shi'i split to contemporary political and social issues.  Emphasis of Sufi literature, art, architecture, and philosophies of Islam.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Approaches to Religion and Spirituality": {
        "ID": "RELS344",
        "UNITS": "4",
        "DESC": "Examination of religion from an academic perspective by surveying the various historical approaches employed within the discipline of religious studies to collect, analyze, and interpret religious phenomena cross-culturally.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Religion, Gender, and Society": {
        "ID": "WGQS370",
        "UNITS": "4",
        "DESC": "Critical examination of religious ideas and institutions in the United States.  Focus on interlocking systems of sex, gender, race, class and religion; individual and group experiences at the intersection of religion, politics and culture.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Crosslisted as RELS/WGQSÂ 370.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.  Formerly WGS 370.\n"
    },
    "Spiritual Extremism: Asceticism, Mysticism, and Madness": {
        "ID": "RELS372",
        "UNITS": "4",
        "DESC": "Shaping influence of ascetics, mystics and the insane on global religious traditions.  Topics may include the relationship between spiritual extremists and society, cultural construction of holiness and insanity, and literary depictions of spiritual extremists.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Religion and Violence": {
        "ID": "RELS374",
        "UNITS": "4",
        "DESC": "Historical and contemporary case studies of how various religions have condoned, motivated and justified violence.  The place of sacrifice, martyrdom, self-injury and forced conversion in religious doctrines.  Representations of religious violence in the media.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Religion and Contemporary Values": {
        "ID": "RELS378",
        "UNITS": "4",
        "DESC": "Descriptive analysis of how diverse religious traditions construct moral decisions about a variety of contemporary issues including sexuality, ecology, and justice.  Challenges for religious value systems in secular and pluralistic societies.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Topics in Religious Studies": {
        "ID": "RELS390",
        "UNITS": "4",
        "DESC": "Examination and analysis of religious and spiritual themes and traditions.  Topics may be of historical or contemporary importance.  The Class Schedule will list topic selected.  Total credit limited to 16 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Selected Environmental Issues of California's Central Coast": {
        "ID": "SCM360",
        "UNITS": "4",
        "DESC": "Examination of several inter-related environmental issues currently affecting California's Central Coast region.  Focuses on the role of technology in creating/mitigating environmental problems.  Field trips required.  3 lectures, 1 activity.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Comparative Societies": {
        "ID": "SOC110",
        "UNITS": "4",
        "DESC": "Introduction to sociological theory and methods, emphasizing a comparative analysis of social institutions of contemporary societies in major world regions, including the family, politics, and the economy. Direct comparisons made between United States social institutions and those of other societies. Course may be offered in classroom-based or online format. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "International Political Economy": {
        "ID": "SOC218",
        "UNITS": "4",
        "DESC": "Sociological perspectives on the historical development of the world system and why global inequality exists and is perpetuated within and between countries. Critical comparison of the political economy of nations with an emphasis on the Global South. Course may be offered classroom-based, online, or hybrid format. 4 lectures. Fulfills GE Area D2 (GE Area D2 or GE Area D3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Global Race and Ethnic Relations": {
        "ID": "SOC315",
        "UNITS": "4",
        "DESC": "Diverse structures of unequal relationships among racial and ethnic groups in several countries including the United States.  Theories about sources of economic and social discrimination and colonialism.  Focus on the concept of ethnicity.  Evaluation methods to restructure race and ethnic relations.  International case histories.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Migration": {
        "ID": "SOC321",
        "UNITS": "4",
        "DESC": "Critical examination of migration, with emphasis on migration to and within the United States.  Social and economic impacts on sending communities, receiving communities, and migrants themselves.  Grounded in migration theory.  Comparisons between current and historical migration trends and policies.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Sociology of the Life Cycle": {
        "ID": "SOC326",
        "UNITS": "4",
        "DESC": "Change and continuity of the self through the life course.  Impact of aging on the physical, emotional, intellectual and social aspects of well being, and how this knowledge can be applied to enhance the quality of life.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Social Change": {
        "ID": "SOC327",
        "UNITS": "4",
        "DESC": "Compares and contrasts social change strategies over time and across diverse social problems, focusing mainly on the U.S., but not exclusively.  Theoretical and critical examination of contemporary efforts to address restricted opportunities by groups who have been historically marginalized due to race/ethnicity, lower socioeconomic status, sexuality, or other social identities.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Contemporary Societies of the Developing World": {
        "ID": "SOC343",
        "UNITS": "4",
        "DESC": "Investigation of societies in developing countries, from broad regional trends to community-specific case studies.  Gender, race, education, health, aging, families, inequality, and resilience.  Readings and films emphasize voices from within the focal communities.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Sociology of Religion": {
        "ID": "SOC377",
        "UNITS": "4",
        "DESC": "Religion from a sociological perspective.  Topics may include the nature of religious experience, the role of religion in politics, economics, and social change, and the role that social forces have in influencing religious beliefs and practices.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introductory Soil Science": {
        "ID": "SS120",
        "UNITS": "4",
        "DESC": "Biological, chemical, physical and genetic properties of soils. Application of scientific principles to solving land use, water management, and soil conservation problems. Interpretation of soils data for making environmental decisions, applying management practices, and sustainable food production. 3 lectures, 1 laboratory. Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Soils in Environmental and Agricultural Systems": {
        "ID": "SS130",
        "UNITS": "4",
        "DESC": "Soils' ecological functions; soil and the water cycle; soil in production of food, fiber, and forest materials; techniques and reports of soil analyses with agricultural and environmental applications; soil quality; introductory overview of soils and civilizations. Not open to students with credit in SSÂ 120. 3 lectures, 1 laboratory. Fulfills GE Areas B1 and B3 (GE Areas B3 and B4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Spanish I Study Abroad": {
        "ID": "SPAN141",
        "UNITS": "4",
        "DESC": "Beginning Spanish.  Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in SPANÂ 101, 104, or SPANÂ 111.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Spanish II Study Abroad": {
        "ID": "SPAN142",
        "UNITS": "4",
        "DESC": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in SPANÂ 102 or 104.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Elementary Spanish III Study Abroad": {
        "ID": "SPAN143",
        "UNITS": "4",
        "DESC": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in SPANÂ 103 or 104.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Introduction to Hispanic Readings": {
        "ID": "SPAN233",
        "UNITS": "4",
        "DESC": "Selected readings from Hispanic authors that show the Hispanic literary tradition from the Middle Ages to the present in Spain, Latin America, and of Latino/a writers in the United States.  May include film and other media.  Conducted in Spanish.  4 lectures.  Fulfills GE Area C2 (GE Area C1 or GE Area C2 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Spanish I Study Abroad": {
        "ID": "SPAN241",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Spanish.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in SPANÂ 201.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Spanish II Study Abroad": {
        "ID": "SPAN242",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Spanish.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in SPANÂ 202.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Intermediate Spanish III Study Abroad": {
        "ID": "SPAN243",
        "UNITS": "4",
        "DESC": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Spanish.  Language taught in its intercultural context at a Cal Poly Global Program study center.  Not open to students with credit in SPANÂ 203 or SPANÂ 206.  3 lectures, 1 activity.  Fulfills GE Area C2 (GE Area C1, C2, or C5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Significant Works in Spanish": {
        "ID": "SPAN305",
        "UNITS": "4",
        "DESC": "Critical analysis and oral discussion of poetry, essays, novels, plays, films, and other media by selected Hispanic authors.  Conducted in Spanish.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Spanish and Latin American Film": {
        "ID": "SPAN307",
        "UNITS": "4",
        "DESC": "Study, analysis, and critique of films from Spain and/or Latin America, organized around such topics as individual film directors or genres, national and international film traditions, migration, gender, ethnicity, and politics.  Evaluation of works in their cultural contexts.  The Class Schedule will list topic selected and language of instruction (English or Spanish).  Total credit limited to 8 units.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Chicano/a Authors": {
        "ID": "SPAN340",
        "UNITS": "4",
        "DESC": "Introduction to Chicano/a literary accomplishments to facilitate appreciation of Chicano/a literary aesthetics and increase understanding of Chicano/a cultural values and lifestyles.  Conducted in Spanish.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Hispanic Literature in English Translation": {
        "ID": "SPAN350",
        "UNITS": "4",
        "DESC": "Selected works to be read by students in English translation.  Critical analysis, interpretation, and comparison of works by Hispanic authors.  Course may include film and other media.  Discussion in English.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Chicano/Latino Writers in the United States": {
        "ID": "SPAN351",
        "UNITS": "4",
        "DESC": "Analysis and exploration of the major themes of Chicano/Latino literature in the United States today.  Emphasis on Chicano/a, Puerto Rican, Cuban American and other U.S.  Latino/a writers.  All readings and discussions in English.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Understanding Special Education": {
        "ID": "SPED420",
        "UNITS": "4",
        "DESC": "Overview of the field of special education, including a historical perspective of special education, special education law, service delivery models, and characteristics of students with variable learning needs.  3 seminars, 1 activity.\n"
    },
    "Introduction to Statistical Reasoning": {
        "ID": "STAT130",
        "UNITS": "4",
        "DESC": "Survey of statistical ideas and philosophy.  Emphasis on concepts rather than in-depth coverage of statistical methods.  Topics include sampling, experimentation, data exploration, chance phenomena, and methods of statistical inference.  Not open to students with credit in any statistics course.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Introduction to Statistical Concepts and Methods": {
        "ID": "STAT217",
        "UNITS": "4",
        "DESC": "Sampling and experimentation, descriptive statistics, confidence intervals, two-sample hypothesis tests for means and proportions, Chi-square tests, linear and multiple regression, analysis of variance.  Substantial use of statistical software.  Not open to students with credit in STATÂ 218 or STATÂ 251.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Applied Statistics for the Life Sciences": {
        "ID": "STAT218",
        "UNITS": "4",
        "DESC": "Data collection and experimental design, descriptive statistics, confidence intervals, parametric and non parametric one and two-sample hypothesis tests, analysis of variance, correlation, simple linear regression, chi-square tests.  Applications of statistics to the life sciences.  Substantial use of statistical software.  Course may be offered in classroom-based, online, or hybrid format.  Not open to students with credit in STATÂ 217 or STATÂ 251.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Statistical Inference for Management I": {
        "ID": "STAT251",
        "UNITS": "4",
        "DESC": "Descriptive statistics.  Probability and counting rules.  Random variables and probability distributions.  Sampling distributions and point estimation.  Confidence intervals and tests of hypotheses for a single mean and proportion.  Course may be offered classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Statistical Inference for Management II": {
        "ID": "STAT252",
        "UNITS": "5",
        "DESC": "Confidence intervals and tests of hypotheses for two means and two proportions.  Introduction to ANOVA, regression, correlation, multiple regression, time series, and forecasting.  Statistical quality control.  Enumerative data analysis.  Substantial use of statistical software.  Course may be offered in classroom-based, online, or hybrid format.  5 lectures.  Fulfills GE Area B4 (GE Area B1 for students on the 2019-20 or earlier catalogs); a grade of C- or better is required in one course in this GE area.\n"
    },
    "Statistical Methods for Engineers": {
        "ID": "STAT312",
        "UNITS": "4",
        "DESC": "Descriptive and graphical methods.  Discrete and continuous probability distributions.  One and two sample confidence intervals and hypothesis testing.  Single factor analysis of variance.  Quality control.  Introduction to regression and to experimental design.  Substantial use of statistical software.  Not open to students with credit in STATÂ 252 or STATÂ 302.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Applied Experimental Design and Regression Models": {
        "ID": "STAT313",
        "UNITS": "4",
        "DESC": "Applications of statistics for students not majoring in statistics or mathematics.  Analysis of variance including one-way classification, randomized blocks, and factorial designs; multiple regression, model diagnostics, and model comparison.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Probability and Statistics for Engineers and Scientists": {
        "ID": "STAT321",
        "UNITS": "4",
        "DESC": "Tabular and graphical methods for data summary, numerical summary measures, probability concepts and properties, discrete and continuous probability distributions, expected values, statistics and their sampling distributions, point estimation, confidence intervals for a mean and proportion.  Use of statistical software.  Not open to students with credit in STATÂ 301.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Probability and Random Processes for Engineers": {
        "ID": "STAT350",
        "UNITS": "4",
        "DESC": "Random events, random variables, and random processes, with emphasis on probabilistic treatment of signals and noise.  Specific topics include:  sample spaces, probability, distributions, independence, moments, covariance, time/ensemble averages, stationarity, common processes, correlation and spectral functions.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.   Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Introduction to Theatre": {
        "ID": "TH210",
        "UNITS": "4",
        "DESC": "Overview of theatre principles and production practices, including terminology and conventions, methods, dramatic literature and performance, aesthetic appreciation, and technology. Emphasis on theatre as an integral cultural, social, and artistic entity. Attendance at theatre performance(s) required. Course may be offered in classroom-based, online, or hybrid format. Not open to students with credit in THÂ 201. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Theatre History I": {
        "ID": "TH227",
        "UNITS": "4",
        "DESC": "Examine the traditions of theater, primarily Western, from its origins to the European Renaissance, within the context of wider cultural and political developments. Production methods, acting styles, playwriting theories and representative plays. Course may be offered in classroom-based or hybrid format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Theatre History II": {
        "ID": "TH228",
        "UNITS": "4",
        "DESC": "Highlights of European and North American theatrical history from the 18th to 21st century. Production methods, acting styles, playwriting theories and representative plays. Course may be offered in classroom-based, online, or hybrid format. 4 lectures. Fulfills GE Area C1 (GE Area C3 for students on the 2019-21 or earlier catalogs).\n"
    },
    "Topics in Diversity on the American Stage": {
        "ID": "TH305",
        "UNITS": "4",
        "DESC": "Critical analysis of traditionally underrepresented groups in the American theatre, as writers, practitioners, story subjects.  Investigation of dramatic literature and performance trends related to special interest topics.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Global Theatre and Performance": {
        "ID": "TH390",
        "UNITS": "4",
        "DESC": "Investigation of non-American theatre and dramatic performance; emphasis on plays, playwrights, and movements as portraits of philosophical/national make-up.  Topical emphasis focuses on the definition and development of a cultural identity via the context of historical and contemporary theatre practices.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Survey of Grape Growing and Winemaking": {
        "ID": "WVIT300",
        "UNITS": "4",
        "DESC": "Fundamentals of viticulture and enology.  Overview of grapevine physiology, major varieties, soils, climatic factors, management practices and wine regions of the world.  Exploration of wine fermentation, finishing, aging, bottling and wine chemistry.  Compare red, white, sparkling and fortified wine production.  Not open to students with credit in WVITÂ 202 or WVITÂ 233.  4 lectures.  Fulfills GE Area Upper-Division B (GE Areas B5, B6, or B7 for students on the 2019-20 catalog).\n"
    },
    "Reasoning, Argumentation, and Writing on Gender and Sexuality": {
        "ID": "WGQS145",
        "UNITS": "4",
        "DESC": "Principles of reasoning in argumentation; examination of rhetorical principles and responsible rhetorical behavior; application of these principles to written and oral communication; and effective use of research methods and sources, all in relation to WGQS topics.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Area A3 with a grade of C- or better.  Formerly WGS 145.\n"
    },
    "Contemporary Issues in Women's and Gender Studies": {
        "ID": "WGQS301",
        "UNITS": "4",
        "DESC": "Exploration of contemporary issues in local, national, and comparative transnational contexts as addressed within the interdisciplinary field of Women's & Gender Studies, with an emphasis on the complex intersections of gender and sexuality with race, class, and other social factors.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  4 lectures.   Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.  Formerly WGS 301.\n"
    },
    "Contemporary Issues in Queer Studies": {
        "ID": "WGQS302",
        "UNITS": "4",
        "DESC": "Exploration of contemporary issues as addressed within the interdisciplinary field of Queer Studies, with an emphasis on the relationships between constructions, experiences and expressions of sexuality and interlocking systems of race, ethnicity, religion, class, nation, age, dis/ability and gender in local, national, and transnational contexts.  The Class Schedule will list topic selected.  Total credit limited to 8 units.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs); and USCP.  Formerly WGS 302.\n"
    },
    "Women, Gender and Sexuality in Global Perspective": {
        "ID": "WGQS320",
        "UNITS": "4",
        "DESC": "Examination of women's lives, genders and sexualities in relation to intersecting systems of class, race/ethnicity, religion and nation in comparative cross-cultural contexts.  Includes study of global and transnational feminisms, reproductive rights, women's labor, women in development, women's politics.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).  Formerly WGS 320.\n"
    },
    "Masculinity Studies": {
        "ID": "WGQS325",
        "UNITS": "4",
        "DESC": "Analysis of hegemonic and counter-hegemonic masculinities through a critical, interdisciplinary, and intersectional examination of the social construction of manhood in the U.S.  Course may be offered in classroom-based, online, or hybrid format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).  Formerly WGS 325.\n"
    },
    "Feminist/Queer Transnational Studies": {
        "ID": "WGQS330",
        "UNITS": "4",
        "DESC": "Intersectional, interdisciplinary investigation of gender and sexuality in transnational contexts.  Exploration of the ways that gender and sexuality shape, and are shaped by, colonialism, globalization, nation-building, development, migration, and human rights.  Social justice organizing/movements around the world and transnational activism.  Not open to students with credit in WGQSÂ 320.  Course may be offered in classroom-based, online, or hybrid format.  4 seminars.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    },
    "World Cultures through Film": {
        "ID": "WLC307",
        "UNITS": "4",
        "DESC": "Survey and analysis of aesthetic, historical, political, and social themes in twentieth and twenty-first-century cultures as represented in world cinema.  Historical, literary, and theoretical readings.  The Class Schedule will list topic selected and language of instruction (English or another language).  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Humanities in World Cultures": {
        "ID": "WLC310",
        "UNITS": "4",
        "DESC": "Interdisciplinary examination of the humanities in a selected culture.  Special focus on the arts, literature, philosophy and language in that culture.  The Class Schedule will list topic selected.  Total credit limited to 12 units with different subtopic.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Humanities in Chicano/a Culture": {
        "ID": "WLC312",
        "UNITS": "4",
        "DESC": "Interdisciplinary examination of humanities in Chicano culture.  Special focus on the arts, literature, social situations, and the monolingual and bilingual language aspects in Chicano culture.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs); and USCP.\n"
    },
    "Critical Issues in Latin American Studies": {
        "ID": "WLC315",
        "UNITS": "4",
        "DESC": "An interdisciplinary approach to selected topics and issues that address how social, economic, political, and cultural forces have shaped the challenges that face contemporary Latin America.  Descriptive subtitles assigned to each course.  Field trips required.  The Class Schedule will list topic selected.  Total credit limited to 12 units.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).  Formerly ISLA 315.\n"
    },
    "Literatures in World Cultures": {
        "ID": "WLC350",
        "UNITS": "4",
        "DESC": "Selected works to be read by students in English translation.  Critical analysis, interpretation, and comparison of works by authors from diverse world regions taught in their cultural contexts.  Course may include film and other media.  Discussion in English.  The Class Schedule will list topic selected.  Course may be offered in classroom-based or online format.  Total credit limited to 8 units.  4 lectures.  Fulfills GE Upper-Division C (GE Area C4 for students on the 2019-20 or earlier catalogs).\n"
    },
    "Language, Technology and Society": {
        "ID": "WLC370",
        "UNITS": "4",
        "DESC": "Focus on ways in which technology impacts language use.  Characteristics of social media interactions (texting, Facebook) in different languages (e.g., Spanish, French, German, Chinese) are compared.  Special attention given to linguistic diversity and the emergence of multilingual identities on digital platforms.  Course may be offered in classroom-based or online format.  4 lectures.  Fulfills GE Upper-Division D (GE Area D5 for students on the 2019-20 or earlier catalogs).\n"
    }
}